MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_usart.h
/**
  ******************************************************************************
  * @file    stm32c5xx_ll_usart.h
  * @brief   Header file of USART LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32C5XX_LL_USART_H
#define STM32C5XX_LL_USART_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32c5xx.h"

/** @addtogroup STM32C5xx_LL_Driver
  * @{
  */

#if defined(USART1) || defined(USART2) || defined(USART3) || defined(UART4) || defined(UART5) || defined(USART6) \
 || defined(UART7)

/** @defgroup USART_LL USART
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @defgroup USART_LL_Private_Variables USART Private Variables
  * @{
  */
/* Array used to get the USART prescaler division decimal values versus @ref USART_LL_EC_PRESCALER values */
static const uint32_t USART_PRESCALER_TAB[16] =
{
  1UL,
  2UL,
  4UL,
  6UL,
  8UL,
  10UL,
  12UL,
  16UL,
  32UL,
  64UL,
  128UL,
  256UL,
  256UL,
  256UL,
  256UL,
  256UL,
};
/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/
/** @defgroup USART_LL_Private_Constants USART Private Constants
  * @{
  */
#define LL_USART_TRIG_MASK           0x10000000U
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup USART_LL_Exported_Constants LL USART Constants
  * @{
  */

/** @defgroup USART_LL_EC_CLEAR_FLAG Clear Flags Defines
  * @brief    Flags defines which can be used with LL_USART_WRITE_REG function.
  * @{
  */
#define LL_USART_ICR_PECF            USART_ICR_PECF                       /*!< Parity error clear flag */
#define LL_USART_ICR_FECF            USART_ICR_FECF                       /*!< Framing error clear flag */
#define LL_USART_ICR_NECF            USART_ICR_NECF                       /*!< Noise error detected clear flag */
#define LL_USART_ICR_ORECF           USART_ICR_ORECF                      /*!< Overrun error clear flag */
#define LL_USART_ICR_IDLECF          USART_ICR_IDLECF                     /*!< Idle line detected clear flag */
#define LL_USART_ICR_TXFECF          USART_ICR_TXFECF                     /*!< TX FIFO Empty clear flag */
#define LL_USART_ICR_TCCF            USART_ICR_TCCF                       /*!< Transmission complete clear flag */
#define LL_USART_ICR_TCBGTCF         USART_ICR_TCBGTCF                    /*!< Transmission completed before guard time clear flag */
#define LL_USART_ICR_LBDCF           USART_ICR_LBDCF                      /*!< LIN break detection clear flag */
#define LL_USART_ICR_CTSCF           USART_ICR_CTSCF                      /*!< CTS clear flag */
#define LL_USART_ICR_RTOCF           USART_ICR_RTOCF                      /*!< Receiver timeout clear flag */
#define LL_USART_ICR_EOBCF           USART_ICR_EOBCF                      /*!< End of block clear flag */
#define LL_USART_ICR_UDRCF           USART_ICR_UDRCF                      /*!< SPI Slave Underrun clear flag */
#define LL_USART_ICR_CMCF            USART_ICR_CMCF                       /*!< Character match clear flag */
#define LL_USART_ICR_WUCF            USART_ICR_WUCF                       /*!< Wakeup from Stop mode clear flag */
/**
  * @}
  */

/** @defgroup USART_LL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with LL_USART_READ_REG function.
  * @{
  */
#define LL_USART_ISR_PE              USART_ISR_PE                         /*!< Parity error flag */
#define LL_USART_ISR_FE              USART_ISR_FE                         /*!< Framing error flag */
#define LL_USART_ISR_NE              USART_ISR_NE                         /*!< Noise detected flag */
#define LL_USART_ISR_ORE             USART_ISR_ORE                        /*!< Overrun error flag */
#define LL_USART_ISR_IDLE            USART_ISR_IDLE                       /*!< Idle line detected flag */
#define LL_USART_ISR_RXNE_RXFNE      USART_ISR_RXNE_RXFNE                 /*!< Read data register or RX FIFO not empty flag */
#define LL_USART_ISR_TC              USART_ISR_TC                         /*!< Transmission complete flag */
#define LL_USART_ISR_TXE_TXFNF       USART_ISR_TXE_TXFNF                  /*!< Transmit data register empty or TX FIFO Not Full flag*/
#define LL_USART_ISR_LBDF            USART_ISR_LBDF                       /*!< LIN break detection flag */
#define LL_USART_ISR_CTSIF           USART_ISR_CTSIF                      /*!< CTS interrupt flag */
#define LL_USART_ISR_CTS             USART_ISR_CTS                        /*!< CTS flag */
#define LL_USART_ISR_RTOF            USART_ISR_RTOF                       /*!< Receiver timeout flag */
#define LL_USART_ISR_EOBF            USART_ISR_EOBF                       /*!< End of block flag */
#define LL_USART_ISR_UDR             USART_ISR_UDR                        /*!< SPI Slave underrun error flag */
#define LL_USART_ISR_ABRE            USART_ISR_ABRE                       /*!< Auto baud rate error flag */
#define LL_USART_ISR_ABRF            USART_ISR_ABRF                       /*!< Auto baud rate flag */
#define LL_USART_ISR_BUSY            USART_ISR_BUSY                       /*!< Busy flag */
#define LL_USART_ISR_CMF             USART_ISR_CMF                        /*!< Character match flag */
#define LL_USART_ISR_SBKF            USART_ISR_SBKF                       /*!< Send break flag */
#define LL_USART_ISR_RWU             USART_ISR_RWU                        /*!< Receiver wakeup from Mute mode flag */
#define LL_USART_ISR_WUF             USART_ISR_WUF                        /*!< Wakeup from Stop mode flag */
#define LL_USART_ISR_TEACK           USART_ISR_TEACK                      /*!< Transmit enable acknowledge flag */
#define LL_USART_ISR_REACK           USART_ISR_REACK                      /*!< Receive enable acknowledge flag */
#define LL_USART_ISR_TXFE            USART_ISR_TXFE                       /*!< TX FIFO empty flag */
#define LL_USART_ISR_RXFF            USART_ISR_RXFF                       /*!< RX FIFO full flag */
#define LL_USART_ISR_TCBGT           USART_ISR_TCBGT                      /*!< Transmission complete before guard time completion flag */
#define LL_USART_ISR_RXFT            USART_ISR_RXFT                       /*!< RX FIFO threshold flag */
#define LL_USART_ISR_TXFT            USART_ISR_TXFT                       /*!< TX FIFO threshold flag */
/**
  * @}
  */

/** @defgroup USART_LL_EC_IT IT Defines
  * @brief    IT defines which can be used with LL_USART_READ_REG and  LL_USART_WRITE_REG functions.
  * @{
  */
#define LL_USART_CR1_IDLEIE          USART_CR1_IDLEIE                     /*!< IDLE interrupt enable */
#define LL_USART_CR1_RXNEIE_RXFNEIE  USART_CR1_RXNEIE_RXFNEIE             /*!< Read data register and RXFIFO not empty interrupt enable */
#define LL_USART_CR1_TCIE            USART_CR1_TCIE                       /*!< Transmission complete interrupt enable */
#define LL_USART_CR1_TXEIE_TXFNFIE   USART_CR1_TXEIE_TXFNFIE              /*!< Transmit data register empty and TX FIFO not full interrupt enable */
#define LL_USART_CR1_PEIE            USART_CR1_PEIE                       /*!< Parity error interrupt enable */
#define LL_USART_CR1_CMIE            USART_CR1_CMIE                       /*!< Character match interrupt enable */
#define LL_USART_CR1_RTOIE           USART_CR1_RTOIE                      /*!< Receiver timeout interrupt enable */
#define LL_USART_CR1_EOBIE           USART_CR1_EOBIE                      /*!< End of Block interrupt enable */
#define LL_USART_CR1_TXFEIE          USART_CR1_TXFEIE                     /*!< TX FIFO empty interrupt enable */
#define LL_USART_CR1_RXFFIE          USART_CR1_RXFFIE                     /*!< RX FIFO full interrupt enable */
#define LL_USART_CR2_LBDIE           USART_CR2_LBDIE                      /*!< LIN break detection interrupt enable */
#define LL_USART_CR3_EIE             USART_CR3_EIE                        /*!< Error interrupt enable */
#define LL_USART_CR3_CTSIE           USART_CR3_CTSIE                      /*!< CTS interrupt enable */
#define LL_USART_CR3_WUFIE           USART_CR3_WUFIE                      /*!< Wakeup from Stop mode interrupt enable */
#define LL_USART_CR3_TXFTIE          USART_CR3_TXFTIE                     /*!< TX FIFO threshold interrupt enable */
#define LL_USART_CR3_TCBGTIE         USART_CR3_TCBGTIE                    /*!< Transmission complete before guard time interrupt enable */
#define LL_USART_CR3_RXFTIE          USART_CR3_RXFTIE                     /*!< RX FIFO threshold interrupt enable */
/**
  * @}
  */

/** @defgroup USART_LL_EC_FIFOTHRESHOLD FIFO Threshold
  * @{
  */
#define LL_USART_FIFO_THRESHOLD_1_8        0x00000000U                    /*!< FIFO reaches 1/8 of its depth */
#define LL_USART_FIFO_THRESHOLD_1_4        0x00000001U                    /*!< FIFO reaches 1/4 of its depth */
#define LL_USART_FIFO_THRESHOLD_1_2        0x00000002U                    /*!< FIFO reaches 1/2 of its depth */
#define LL_USART_FIFO_THRESHOLD_3_4        0x00000003U                    /*!< FIFO reaches 3/4 of its depth */
#define LL_USART_FIFO_THRESHOLD_7_8        0x00000004U                    /*!< FIFO reaches 7/8 of its depth */
#define LL_USART_FIFO_THRESHOLD_8_8        0x00000005U                    /*!< FIFO becomes empty for TX and full for RX */
/**
  * @}
  */

/** @defgroup USART_LL_EC_DIRECTION Communication Direction
  * @{
  */
#define LL_USART_DIRECTION_NONE           0x00000000U                     /*!< Transmitter and Receiver are disabled */
#define LL_USART_DIRECTION_RX             USART_CR1_RE                    /*!< Transmitter is disabled and Receiver is enabled */
#define LL_USART_DIRECTION_TX             USART_CR1_TE                    /*!< Transmitter is enabled and Receiver is disabled */
#define LL_USART_DIRECTION_TX_RX          (USART_CR1_TE |USART_CR1_RE)    /*!< Transmitter and Receiver are enabled */
/**
  * @}
  */

/** @defgroup USART_LL_EC_PARITY Parity Control
  * @{
  */
#define LL_USART_PARITY_NONE              0x00000000U                     /*!< Parity control disabled */
#define LL_USART_PARITY_EVEN              USART_CR1_PCE                   /*!< Parity control enabled and Even Parity is selected */
#define LL_USART_PARITY_ODD               (USART_CR1_PCE | USART_CR1_PS)  /*!< Parity control enabled and Odd Parity is selected */
/**
  * @}
  */

/** @defgroup USART_LL_EC_WAKEUP Wakeup
  * @{
  */
#define LL_USART_WAKEUP_METHOD_IDLE_LINE          0x00000000U             /*!<  USART wake up from Mute mode on Idle Line */
#define LL_USART_WAKEUP_METHOD_ADDRESS_MARK       USART_CR1_WAKE          /*!<  USART wake up from Mute mode on Address Mark */
/**
  * @}
  */

/** @defgroup USART_LL_EC_DATAWIDTH Datawidth
  * @{
  */
#define LL_USART_DATAWIDTH_7_BIT          USART_CR1_M1                    /*!< 7 bit word length : Start bit, 7 data bits, n stop bits */
#define LL_USART_DATAWIDTH_8_BIT          0x00000000U                     /*!< 8 bit word length : Start bit, 8 data bits, n stop bits */
#define LL_USART_DATAWIDTH_9_BIT          USART_CR1_M0                    /*!< 9 bit word length : Start bit, 9 data bits, n stop bits */
/**
  * @}
  */

/** @defgroup USART_LL_EC_OVERSAMPLING Oversampling
  * @{
  */
#define LL_USART_OVERSAMPLING_16          0x00000000U                     /*!< Oversampling by 16 */
#define LL_USART_OVERSAMPLING_8           USART_CR1_OVER8                 /*!< Oversampling by 8 */
/**
  * @}
  */

/** @defgroup USART_LL_EC_LASTCLKPULSE Last Clock Pulse
  * @{
  */
#define LL_USART_LASTCLKPULSE_DISABLED    0x00000000U                     /*!< The clock pulse of the last data bit is not output to the SCLK pin */
#define LL_USART_LASTCLKPULSE_ENABLED     USART_CR2_LBCL                  /*!< The clock pulse of the last data bit is output to the SCLK pin */
/**
  * @}
  */

/** @defgroup USART_LL_EC_CLOCKOUTPUT Clock Output
  * @{
  */
#define LL_USART_CLOCK_OUTPUT_DISABLED    0x00000000U                     /*!< The clock signal output is disabled */
#define LL_USART_CLOCK_OUTPUT_ENABLED     USART_CR2_CLKEN                 /*!< The clock signal output is enabled */
/**
  * @}
  */

/** @defgroup USART_LL_EC_PHASE Clock Phase
  * @{
  */
#define LL_USART_CLOCK_PHASE_1_EDGE       0x00000000U                     /*!< The first clock transition is the first data capture edge */
#define LL_USART_CLOCK_PHASE_2_EDGE       USART_CR2_CPHA                  /*!< The second clock transition is the first data capture edge */
/**
  * @}
  */

/** @defgroup USART_LL_EC_POLARITY Clock Polarity
  * @{
  */
#define LL_USART_CLOCK_POLARITY_LOW       0x00000000U                     /*!< Steady low value on SCLK pin outside transmission window*/
#define LL_USART_CLOCK_POLARITY_HIGH      USART_CR2_CPOL                  /*!< Steady high value on SCLK pin outside transmission window */
/**
  * @}
  */

/** @defgroup USART_LL_EC_PRESCALER Clock Source Prescaler
  * @{
  */
#define LL_USART_PRESCALER_DIV1           0x00000000U                                                                   /*!< Input clock not divided   */
#define LL_USART_PRESCALER_DIV2           (USART_PRESC_PRESCALER_0)                                                     /*!< Input clock divided by 2  */
#define LL_USART_PRESCALER_DIV4           (USART_PRESC_PRESCALER_1)                                                     /*!< Input clock divided by 4  */
#define LL_USART_PRESCALER_DIV6           (USART_PRESC_PRESCALER_1 | USART_PRESC_PRESCALER_0)                           /*!< Input clock divided by 6  */
#define LL_USART_PRESCALER_DIV8           (USART_PRESC_PRESCALER_2)                                                     /*!< Input clock divided by 8  */
#define LL_USART_PRESCALER_DIV10          (USART_PRESC_PRESCALER_2 | USART_PRESC_PRESCALER_0)                           /*!< Input clock divided by 10 */
#define LL_USART_PRESCALER_DIV12          (USART_PRESC_PRESCALER_2 | USART_PRESC_PRESCALER_1)                           /*!< Input clock divided by 12 */
#define LL_USART_PRESCALER_DIV16          (USART_PRESC_PRESCALER_2 | USART_PRESC_PRESCALER_1 | USART_PRESC_PRESCALER_0) /*!< Input clock divided by 16 */
#define LL_USART_PRESCALER_DIV32          (USART_PRESC_PRESCALER_3)                                                     /*!< Input clock divided by 32 */
#define LL_USART_PRESCALER_DIV64          (USART_PRESC_PRESCALER_3 | USART_PRESC_PRESCALER_0)                           /*!< Input clock divided by 64 */
#define LL_USART_PRESCALER_DIV128         (USART_PRESC_PRESCALER_3 | USART_PRESC_PRESCALER_1)                           /*!< Input clock divided by 128 */
#define LL_USART_PRESCALER_DIV256         (USART_PRESC_PRESCALER_3 | USART_PRESC_PRESCALER_1 | USART_PRESC_PRESCALER_0) /*!< Input clock divided by 256 */
/**
  * @}
  */


