MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_usart.h
/** @defgroup SMARTCARD_LL_EC_PRESCALER SMARTCARD Clock Prescaler
  * @{
  */
#define LL_USART_SMARTCARD_PRESCALER_DIV2           (0x00000001U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /2  */
#define LL_USART_SMARTCARD_PRESCALER_DIV4           (0x00000002U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /4  */
#define LL_USART_SMARTCARD_PRESCALER_DIV6           (0x00000003U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /6  */
#define LL_USART_SMARTCARD_PRESCALER_DIV8           (0x00000004U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /8  */
#define LL_USART_SMARTCARD_PRESCALER_DIV10          (0x00000005U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /10 */
#define LL_USART_SMARTCARD_PRESCALER_DIV12          (0x00000006U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /12 */
#define LL_USART_SMARTCARD_PRESCALER_DIV14          (0x00000007U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /14 */
#define LL_USART_SMARTCARD_PRESCALER_DIV16          (0x00000008U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /16 */
#define LL_USART_SMARTCARD_PRESCALER_DIV18          (0x00000009U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /18 */
#define LL_USART_SMARTCARD_PRESCALER_DIV20          (0x00000010U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /20 */
#define LL_USART_SMARTCARD_PRESCALER_DIV22          (0x00000011U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /22 */
#define LL_USART_SMARTCARD_PRESCALER_DIV24          (0x00000012U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /24 */
#define LL_USART_SMARTCARD_PRESCALER_DIV26          (0x00000013U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /26 */
#define LL_USART_SMARTCARD_PRESCALER_DIV28          (0x00000014U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /28 */
#define LL_USART_SMARTCARD_PRESCALER_DIV30          (0x00000015U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /30 */
#define LL_USART_SMARTCARD_PRESCALER_DIV32          (0x00000016U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /32 */
#define LL_USART_SMARTCARD_PRESCALER_DIV34          (0x00000017U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /34 */
#define LL_USART_SMARTCARD_PRESCALER_DIV36          (0x00000018U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /36 */
#define LL_USART_SMARTCARD_PRESCALER_DIV38          (0x00000019U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /38 */
#define LL_USART_SMARTCARD_PRESCALER_DIV40          (0x00000020U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /40 */
#define LL_USART_SMARTCARD_PRESCALER_DIV42          (0x00000021U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /42 */
#define LL_USART_SMARTCARD_PRESCALER_DIV44          (0x00000022U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /44 */
#define LL_USART_SMARTCARD_PRESCALER_DIV46          (0x00000023U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /46 */
#define LL_USART_SMARTCARD_PRESCALER_DIV48          (0x00000024U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /48 */
#define LL_USART_SMARTCARD_PRESCALER_DIV50          (0x00000025U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /50 */
#define LL_USART_SMARTCARD_PRESCALER_DIV52          (0x00000026U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /52 */
#define LL_USART_SMARTCARD_PRESCALER_DIV54          (0x00000027U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /54 */
#define LL_USART_SMARTCARD_PRESCALER_DIV56          (0x00000028U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /56 */
#define LL_USART_SMARTCARD_PRESCALER_DIV58          (0x00000029U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /58 */
#define LL_USART_SMARTCARD_PRESCALER_DIV60          (0x00000030U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /60 */
#define LL_USART_SMARTCARD_PRESCALER_DIV62          (0x00000031U << USART_GTPR_PSC_Pos) /*!< SMARTCARD Output CLK /62 */
/**
  * @}
  */

/** @defgroup USART_LL_EC_STOPBITS Stop Bits
  * @{
  */
#define LL_USART_STOP_BIT_0_5             USART_CR2_STOP_0                               /*!< 0.5 stop bit */
#define LL_USART_STOP_BIT_1               0x00000000U                                    /*!< 1 stop bit */
#define LL_USART_STOP_BIT_1_5             (USART_CR2_STOP_0 | USART_CR2_STOP_1)          /*!< 1.5 stop bits */
#define LL_USART_STOP_BIT_2               USART_CR2_STOP_1                               /*!< 2 stop bits */
/**
  * @}
  */

/** @defgroup USART_LL_EC_TXRX TX RX Pins Swap
  * @{
  */
#define LL_USART_TXRX_STANDARD            0x00000000U                     /*!< TX and RX pins are used as defined in standard pinout */
#define LL_USART_TXRX_SWAPPED             (USART_CR2_SWAP)                /*!< TX and RX pins functions are swapped.             */
/**
  * @}
  */

/** @defgroup USART_LL_EC_RXPIN_LEVEL RX Pin Active Level Inversion
  * @{
  */
#define LL_USART_RXPIN_LEVEL_STANDARD     0x00000000U                     /*!< RX pin signal works using the standard logic levels */
#define LL_USART_RXPIN_LEVEL_INVERTED     (USART_CR2_RXINV)               /*!< RX pin signal values are inverted.                  */
/**
  * @}
  */

/** @defgroup USART_LL_EC_TXPIN_LEVEL TX Pin Active Level Inversion
  * @{
  */
#define LL_USART_TXPIN_LEVEL_STANDARD     0x00000000U                     /*!< TX pin signal works using the standard logic levels */
#define LL_USART_TXPIN_LEVEL_INVERTED     (USART_CR2_TXINV)               /*!< TX pin signal values are inverted.                  */
/**
  * @}
  */

/** @defgroup USART_LL_EC_BINARY_LOGIC Binary Data Inversion
  * @{
  */
#define LL_USART_BINARY_LOGIC_POSITIVE    0x00000000U                     /*!< Logical data from the data register are send/received in positive/direct logic. (1=H, 0=L) */
#define LL_USART_BINARY_LOGIC_NEGATIVE    USART_CR2_DATAINV               /*!< Logical data from the data register are send/received in negative/inverse logic. (1=L, 0=H). The parity bit is also inverted. */
/**
  * @}
  */

/** @defgroup USART_LL_EC_BITORDER Bit Order
  * @{
  */
#define LL_USART_BITORDER_LSB_FIRST        0x00000000U                     /*!< data is transmitted/received with data bit 0 first, following the start bit */
#define LL_USART_BITORDER_MSB_FIRST        USART_CR2_MSBFIRST              /*!< data is transmitted/received with the MSB first, following the start bit */
/**
  * @}
  */

/** @defgroup USART_LL_EC_AUTOBAUD_DETECT_ON Autobaud Detection
  * @{
  */
#define LL_USART_AUTO_BAUD_DETECT_ON_START_BIT     0x00000000U                                 /*!< Measurement of the start bit is used to detect the baud rate */
#define LL_USART_AUTO_BAUD_DETECT_ON_FALLING_EDGE  USART_CR2_ABRMOD_0                         /*!< Falling edge to falling edge measurement. Received frame must start with a single bit = 1 -> Frame = Start10xxxxxx */
#define LL_USART_AUTO_BAUD_DETECT_ON_0X7F_FRAME    USART_CR2_ABRMOD_1                         /*!< 0x7F frame detection */
#define LL_USART_AUTO_BAUD_DETECT_ON_0X55_FRAME    (USART_CR2_ABRMOD_1 | USART_CR2_ABRMOD_0) /*!< 0x55 frame detection */
/**
  * @}
  */

/** @defgroup USART_LL_EC_ADDRESS_DETECT Address Length Detection
  * @{
  */
#define LL_USART_ADDRESS_DETECT_4_BIT        0x00000000U                  /*!< 4-bit address detection method selected */
#define LL_USART_ADDRESS_DETECT_7_BIT        USART_CR2_ADDM7              /*!< 7-bit address detection (in 8-bit data mode) method selected */
/**
  * @}
  */

/** @defgroup USART_LL_EC_HWCONTROL Hardware Control
  * @{
  */
#define LL_USART_HWCONTROL_NONE           0x00000000U                             /*!< CTS and RTS hardware flow control disabled */
#define LL_USART_HWCONTROL_RTS            USART_CR3_RTSE                          /*!< RTS output enabled, data is only requested when there is space in the receive buffer */
#define LL_USART_HWCONTROL_CTS            USART_CR3_CTSE                          /*!< CTS mode enabled, data is only transmitted when the nCTS input is asserted (tied to 0) */
#define LL_USART_HWCONTROL_RTS_CTS        (USART_CR3_RTSE | USART_CR3_CTSE)       /*!< CTS and RTS hardware flow control enabled */
/**
  * @}
  */

