MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_usart.h
/** @defgroup USART_LL_EC_WAKEUP_ON Wakeup Activation
  * @{
  */
#define LL_USART_WAKEUP_ON_ADDRESS        0x00000000U                             /*!< Wake up active on address match */
#define LL_USART_WAKEUP_ON_STARTBIT       USART_CR3_WUS_1                         /*!< Wake up active on Start bit detection */
#define LL_USART_WAKEUP_ON_RXNE           (USART_CR3_WUS_0 | USART_CR3_WUS_1)     /*!< Wake up active on RXNE */
/**
  * @}
  */

/** @defgroup USART_LL_EC_IRDA_POWER IrDA Power
  * @{
  */
#define LL_USART_IRDA_POWER_MODE_NORMAL       0x00000000U                     /*!< IrDA normal power mode */
#define LL_USART_IRDA_POWER_MODE_LOW          USART_CR3_IRLP                  /*!< IrDA low power mode */
/**
  * @}
  */

/** @defgroup USART_LL_EC_LINBREAK_DETECT LIN Break Detection Length
  * @{
  */
#define LL_USART_LIN_BREAK_DETECT_10_BIT      0x00000000U                 /*!< 10-bit break detection method selected */
#define LL_USART_LIN_BREAK_DETECT_11_BIT      USART_CR2_LBDL              /*!< 11-bit break detection method selected */
/**
  * @}
  */

/** @defgroup USART_LL_EC_DE_POLARITY Driver Enable Polarity
  * @{
  */
#define LL_USART_DE_POLARITY_HIGH         0x00000000U                     /*!< DE signal is active high */
#define LL_USART_DE_POLARITY_LOW          USART_CR3_DEP                   /*!< DE signal is active low */
/**
  * @}
  */

/** @defgroup USART_LL_EC_DMA_REG_DATA DMA Register Data
  * @{
  */
#define LL_USART_DMA_REG_DATA_TRANSMIT    0x00000000U                     /*!< Get address of data register used for transmission */
#define LL_USART_DMA_REG_DATA_RECEIVE     0x00000001U                     /*!< Get address of data register used for reception */
/**
  * @}
  */


/** @defgroup USART_LL_EC_Request Request
  * @brief    USART Request.
  * @{
  */
#define LL_USART_REQUEST_SEND_BREAK       USART_RQR_SBKRQ                 /*!< Send Break Request           */
#define LL_USART_REQUEST_MUTE_MODE        USART_RQR_MMRQ                  /*!< Mute Mode Request            */
#define LL_USART_REQUEST_RX_DATA_FLUSH    USART_RQR_RXFRQ                 /*!< Receive Data flush Request   */
#define LL_USART_REQUEST_TX_DATA_FLUSH    USART_RQR_TXFRQ                 /*!< Transmit Data flush Request  */
#define LL_USART_REQUEST_AUTO_BAUD_RATE   USART_RQR_ABRRQ                 /*!< Auto Baud Rate Request       */
/**
  * @}
  */

/** @defgroup USART_LL_EC_One_Bit_Sampling One Bit Sampling Enable
  * @brief    USART One Bit Sampling Enable.
  * @{
  */
#define LL_USART_ONE_BIT_SAMPLE_DISABLE   0x00000000U
#define LL_USART_ONE_BIT_SAMPLE_ENABLE    USART_CR3_ONEBIT

/**
  * @}
  */

/** @defgroup USART_LL_EC_Interruption_Mask    LL_USART Interruptions Flag Mask
  * @{
  */
#define LL_USART_IT_MASK                  0x001FU                         /*!< LL_USART interruptions flags mask */
/**
  * @}
  */

/** @defgroup USART_LL_EC_Slave_Select Slave Select
  * @brief    USART Slave Select.
  * @{
  */
#define LL_USART_NSS_IGNORED              USART_CR2_DIS_NSS
#define LL_USART_NSS_USED                 0x00000000U
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup USART_LL_Exported_Macros LL USART Macros
  * @{
  */

/** @defgroup USART_LL_EM_WRITE_READ Common register Write and Read Macros
  * @{
  */

/**
  * @brief  Write a value in USART register.
  * @param  instance USART Instance
  * @param  reg Register to be written
  * @param  value Value to be written in the register
  */
#define LL_USART_WRITE_REG(instance, reg, value) STM32_WRITE_REG((instance)->reg, (value))

/**
  * @brief  Read a value in USART register.
  * @param  instance USART Instance
  * @param  reg Register to be read
  * @retval Register value
  */
#define LL_USART_READ_REG(instance, reg) STM32_READ_REG((instance)->reg)
/**
  * @}
  */

/** @defgroup USART_LL_EM_Exported_Macros_Helper Exported_Macros_Helper
  * @{
  */

/**
  * @brief  Compute USARTDIV value according to Peripheral Clock and
  *         expected Baud Rate in 8 bits sampling mode (32 bits value of USARTDIV is returned).
  * @param  periph_clock Peripheral Clock frequency used for USART instance
  * @param  prescaler This parameter can be one of the following values:
  *         @arg @ref LL_USART_PRESCALER_DIV1
  *         @arg @ref LL_USART_PRESCALER_DIV2
  *         @arg @ref LL_USART_PRESCALER_DIV4
  *         @arg @ref LL_USART_PRESCALER_DIV6
  *         @arg @ref LL_USART_PRESCALER_DIV8
  *         @arg @ref LL_USART_PRESCALER_DIV10
  *         @arg @ref LL_USART_PRESCALER_DIV12
  *         @arg @ref LL_USART_PRESCALER_DIV16
  *         @arg @ref LL_USART_PRESCALER_DIV32
  *         @arg @ref LL_USART_PRESCALER_DIV64
  *         @arg @ref LL_USART_PRESCALER_DIV128
  *         @arg @ref LL_USART_PRESCALER_DIV256
  * @param  baudrate Baud rate value to achieve
  * @retval USARTDIV value to be used for BRR register filling in OverSampling_8 case
  */
#define LL_USART_DIV_SAMPLING8(periph_clock, prescaler, baudrate) \
  (((((periph_clock)/(USART_PRESCALER_TAB[(prescaler)]))*2U)/(baudrate)) + 1U)

/**
  * @brief  Compute USARTDIV value according to Peripheral Clock and
  *         expected Baud Rate in 16 bits sampling mode (32 bits value of USARTDIV is returned).
  * @param  periph_clock Peripheral Clock frequency used for USART instance
  * @param  prescaler This parameter can be one of the following values:
  *         @arg @ref LL_USART_PRESCALER_DIV1
  *         @arg @ref LL_USART_PRESCALER_DIV2
  *         @arg @ref LL_USART_PRESCALER_DIV4
  *         @arg @ref LL_USART_PRESCALER_DIV6
  *         @arg @ref LL_USART_PRESCALER_DIV8
  *         @arg @ref LL_USART_PRESCALER_DIV10
  *         @arg @ref LL_USART_PRESCALER_DIV12
  *         @arg @ref LL_USART_PRESCALER_DIV16
  *         @arg @ref LL_USART_PRESCALER_DIV32
  *         @arg @ref LL_USART_PRESCALER_DIV64
  *         @arg @ref LL_USART_PRESCALER_DIV128
  *         @arg @ref LL_USART_PRESCALER_DIV256
  * @param  baudrate Baud rate value to achieve
  * @retval USARTDIV value to be used for BRR register filling in OverSampling_16 case
  */
#define LL_USART_DIV_SAMPLING16(periph_clock, prescaler, baudrate) \
  ((((periph_clock)/(USART_PRESCALER_TAB[(prescaler)]))\
    + ((baudrate)/2U))/(baudrate))

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

/** @defgroup USART_LL_Exported_Functions LL USART Functions
  * @{
  */

/** @defgroup USART_LL_EF_Configuration Configuration functions
  * @{
  */

/**
  * @brief  USART Enable.
  * @rmtoll
  *  CR1          UE            LL_USART_Enable
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_Enable(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->CR1, USART_CR1_UE);
}

/**
  * @brief  USART Disable (all USART prescalers and outputs are disabled).
  * @rmtoll
  *  CR1          UE            LL_USART_Disable
  * @param  p_usart USART Instance
  * @note   When USART is disabled, USART prescalers and outputs are stopped immediately,
  *         and current operations are discarded. The configuration of the USART is kept, but all the status
  *         flags, in the p_usart ISR register are set to their default values.
  */
__STATIC_INLINE void LL_USART_Disable(USART_TypeDef *p_usart)
{
  STM32_CLEAR_BIT(p_usart->CR1, USART_CR1_UE);
}

/**
  * @brief  Indicate if USART is enabled.
  * @rmtoll
  *  CR1          UE            LL_USART_IsEnabled
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabled(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR1, USART_CR1_UE) == (USART_CR1_UE)) ? 1UL : 0UL);
}

/**
  * @brief  FIFO Mode Enable.
  * @rmtoll
  *  CR1          FIFOEN        LL_USART_EnableFIFO
  * @param  p_usart USART Instance
  * @note   Use macro IS_UART_FIFO_INSTANCE(p_usart) to check whether
  *         the FIFO mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableFIFO(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->CR1, USART_CR1_FIFOEN);
}

/**
  * @brief  FIFO Mode Disable.
  * @rmtoll
  *  CR1          FIFOEN        LL_USART_DisableFIFO
  * @param  p_usart USART Instance
  * @note   Use macro IS_UART_FIFO_INSTANCE(p_usart) to check whether
  *         the FIFO mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableFIFO(USART_TypeDef *p_usart)
{
  STM32_CLEAR_BIT(p_usart->CR1, USART_CR1_FIFOEN);
}

/**
  * @brief  Indicate if FIFO Mode is enabled.
  * @rmtoll
  *  CR1          FIFOEN        LL_USART_IsEnabledFIFO
  * @param  p_usart USART Instance
  * @note   Use macro IS_UART_FIFO_INSTANCE(p_usart) to check whether
  *         the FIFO mode feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledFIFO(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR1, USART_CR1_FIFOEN) == (USART_CR1_FIFOEN)) ? 1UL : 0UL);
}

/**
  * @brief  Configure TX FIFO Threshold.
  * @rmtoll
  *  CR3          TXFTCFG       LL_USART_SetTXFIFOThreshold
  * @param  p_usart USART Instance
  * @param  threshold This parameter can be one of the following values:
  *         @arg @ref LL_USART_FIFO_THRESHOLD_1_8
  *         @arg @ref LL_USART_FIFO_THRESHOLD_1_4
  *         @arg @ref LL_USART_FIFO_THRESHOLD_1_2
  *         @arg @ref LL_USART_FIFO_THRESHOLD_3_4
  *         @arg @ref LL_USART_FIFO_THRESHOLD_7_8
  *         @arg @ref LL_USART_FIFO_THRESHOLD_8_8
  * @note   Use macro IS_UART_FIFO_INSTANCE(p_usart) to check whether
  *         the FIFO mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_SetTXFIFOThreshold(USART_TypeDef *p_usart, uint32_t threshold)
{
  STM32_ATOMIC_MODIFY_REG_32(p_usart->CR3, USART_CR3_TXFTCFG, threshold << USART_CR3_TXFTCFG_Pos);
}

/**
  * @brief  Return TX FIFO threshold configuration.
  * @rmtoll
  *  CR3          TXFTCFG       LL_USART_GetTXFIFOThreshold
  * @param  p_usart USART Instance
  * @note   Use macro IS_UART_FIFO_INSTANCE(p_usart) to check whether
  *         the FIFO mode feature is supported by the p_usart instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_FIFO_THRESHOLD_1_8
  *         @arg @ref LL_USART_FIFO_THRESHOLD_1_4
  *         @arg @ref LL_USART_FIFO_THRESHOLD_1_2
  *         @arg @ref LL_USART_FIFO_THRESHOLD_3_4
  *         @arg @ref LL_USART_FIFO_THRESHOLD_7_8
  *         @arg @ref LL_USART_FIFO_THRESHOLD_8_8
  */
__STATIC_INLINE uint32_t LL_USART_GetTXFIFOThreshold(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR3, USART_CR3_TXFTCFG) >> USART_CR3_TXFTCFG_Pos);
}

/**
  * @brief  Configure RX FIFO Threshold.
  * @rmtoll
  *  CR3          RXFTCFG       LL_USART_SetRXFIFOThreshold
  * @param  p_usart USART Instance
  * @param  threshold This parameter can be one of the following values:
  *         @arg @ref LL_USART_FIFO_THRESHOLD_1_8
  *         @arg @ref LL_USART_FIFO_THRESHOLD_1_4
  *         @arg @ref LL_USART_FIFO_THRESHOLD_1_2
  *         @arg @ref LL_USART_FIFO_THRESHOLD_3_4
  *         @arg @ref LL_USART_FIFO_THRESHOLD_7_8
  *         @arg @ref LL_USART_FIFO_THRESHOLD_8_8
  * @note   Use macro IS_UART_FIFO_INSTANCE(p_usart) to check whether
  *         the FIFO mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_SetRXFIFOThreshold(USART_TypeDef *p_usart, uint32_t threshold)
{
  STM32_ATOMIC_MODIFY_REG_32(p_usart->CR3, USART_CR3_RXFTCFG, threshold << USART_CR3_RXFTCFG_Pos);
}

/**
  * @brief  Return RX FIFO threshold configuration.
  * @rmtoll
  *  CR3          RXFTCFG       LL_USART_GetRXFIFOThreshold
  * @param  p_usart USART Instance
  * @note   Use macro IS_UART_FIFO_INSTANCE(p_usart) to check whether
  *         the FIFO mode feature is supported by the p_usart instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_FIFO_THRESHOLD_1_8
  *         @arg @ref LL_USART_FIFO_THRESHOLD_1_4
  *         @arg @ref LL_USART_FIFO_THRESHOLD_1_2
  *         @arg @ref LL_USART_FIFO_THRESHOLD_3_4
  *         @arg @ref LL_USART_FIFO_THRESHOLD_7_8
  *         @arg @ref LL_USART_FIFO_THRESHOLD_8_8
  */
__STATIC_INLINE uint32_t LL_USART_GetRXFIFOThreshold(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR3, USART_CR3_RXFTCFG) >> USART_CR3_RXFTCFG_Pos);
}

/**
  * @brief  Configure TX and RX FIFO thresholds.
  * @rmtoll
  *  CR3          TXFTCFG       LL_USART_ConfigFIFOsThreshold \n
  *  CR3          RXFTCFG       LL_USART_ConfigFIFOsThreshold
  * @param  p_usart USART Instance
  * @param  tx_threshold This parameter can be one of the following values:
  *         @arg @ref LL_USART_FIFO_THRESHOLD_1_8
  *         @arg @ref LL_USART_FIFO_THRESHOLD_1_4
  *         @arg @ref LL_USART_FIFO_THRESHOLD_1_2
  *         @arg @ref LL_USART_FIFO_THRESHOLD_3_4
  *         @arg @ref LL_USART_FIFO_THRESHOLD_7_8
  *         @arg @ref LL_USART_FIFO_THRESHOLD_8_8
  * @param  rx_threshold This parameter can be one of the following values:
  *         @arg @ref LL_USART_FIFO_THRESHOLD_1_8
  *         @arg @ref LL_USART_FIFO_THRESHOLD_1_4
  *         @arg @ref LL_USART_FIFO_THRESHOLD_1_2
  *         @arg @ref LL_USART_FIFO_THRESHOLD_3_4
  *         @arg @ref LL_USART_FIFO_THRESHOLD_7_8
  *         @arg @ref LL_USART_FIFO_THRESHOLD_8_8
  * @note   Use macro IS_UART_FIFO_INSTANCE(p_usart) to check whether
  *         the FIFO mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_ConfigFIFOsThreshold(USART_TypeDef *p_usart, uint32_t tx_threshold, uint32_t rx_threshold)
{
  STM32_ATOMIC_MODIFY_REG_32(p_usart->CR3, USART_CR3_TXFTCFG | USART_CR3_RXFTCFG,
                             (tx_threshold << USART_CR3_TXFTCFG_Pos) | (rx_threshold << USART_CR3_RXFTCFG_Pos));
}

/**
  * @brief  USART enabled in STOP Mode.
  * @rmtoll
  *  CR1          UESM          LL_USART_EnableInStopMode
  * @param  p_usart USART Instance
  * @note   When this function is enabled, USART is able to wake up the MCU from Stop mode, provided that
  *         USART clock selection is HSI or LSE in RCC.
  * @note   Macro IS_UART_WAKEUP_FROMSTOP_INSTANCE(p_usart) can be used to check whether or not
  *         Wake-up from Stop mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableInStopMode(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR1, USART_CR1_UESM);
}

/**
  * @brief  USART disabled in STOP Mode.
  * @rmtoll
  *  CR1          UESM          LL_USART_DisableInStopMode
  * @param  p_usart USART Instance
  * @note   When this function is disabled, USART is not able to wake up the MCU from Stop mode
  * @note   Macro IS_UART_WAKEUP_FROMSTOP_INSTANCE(p_usart) can be used to check whether or not
  *         Wake-up from Stop mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableInStopMode(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR1, USART_CR1_UESM);
}

/**
  * @brief  Indicate if USART is enabled in STOP Mode (able to wake up MCU from Stop mode or not).
  * @rmtoll
  *  CR1          UESM          LL_USART_IsEnabledInStopMode
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_WAKEUP_FROMSTOP_INSTANCE(p_usart) can be used to check whether or not
  *         Wake-up from Stop mode feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledInStopMode(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR1, USART_CR1_UESM) == (USART_CR1_UESM)) ? 1UL : 0UL);
}


/**
  * @brief  Configure the USART instance.
  * @rmtoll
  *  CR1         M0             LL_USART_ConfigXfer \n
  *  CR1         M1             LL_USART_ConfigXfer \n
  *  CR1         PCE            LL_USART_ConfigXfer \n
  *  CR1         PS             LL_USART_ConfigXfer \n
  *  CR1         TE             LL_USART_ConfigXfer \n
  *  CR1         RE             LL_USART_ConfigXfer \n
  *  CR1         OVER8          LL_USART_ConfigXfer \n
  *  CR2         STOP_0         LL_USART_ConfigXfer \n
  *  CR2         STOP_1         LL_USART_ConfigXfer \n
  *  CR2         CPOL           LL_USART_ConfigXfer \n
  *  CR2         ABRMODE_0      LL_USART_ConfigXfer \n
  *  CR2         LBLC           LL_USART_ConfigXfer
  * @param  p_usart USART Instance
  * @param cr1_config: This parameter must be a combination of the following groups:
  *         @arg @ref USART_LL_EC_DATAWIDTH
  *         @arg @ref USART_LL_EC_PARITY
  *         @arg @ref USART_LL_EC_DIRECTION
  *         @arg @ref USART_LL_EC_OVERSAMPLING
  * @param cr2_config: This parameter must be a combination of the following groups:
  *         @arg @ref USART_LL_EC_STOPBITS
  *         @arg @ref USART_LL_EC_PHASE
  *         @arg @ref USART_LL_EC_POLARITY
  *         @arg @ref USART_LL_EC_LASTCLKPULSE
  */
__STATIC_INLINE void LL_USART_ConfigXfer(USART_TypeDef *p_usart, uint32_t cr1_config, uint32_t cr2_config)
{
  STM32_MODIFY_REG(p_usart->CR1, (USART_CR1_M0 | USART_CR1_M1 | USART_CR1_PCE | USART_CR1_PS | USART_CR1_TE
                                  | USART_CR1_RE | USART_CR1_OVER8), cr1_config);

  STM32_MODIFY_REG(p_usart->CR2, (USART_CR2_STOP_0 | USART_CR2_STOP_1 | USART_CR2_CPOL | USART_CR2_LBCL
                                  | USART_CR2_CPHA), cr2_config);
}

/**
  * @brief  Configure the USART instance for Smartcard.
  * @rmtoll
  *  CR1         M0             LL_USART_SetSmartcardConfig \n
  *  CR1         M1             LL_USART_SetSmartcardConfig \n
  *  CR1         PS             LL_USART_SetSmartcardConfig \n
  *  CR1         PCE            LL_USART_SetSmartcardConfig \n
  *  CR1         OVER8          LL_USART_SetSmartcardConfig \n
  *  CR2         MSBFIRST       LL_USART_SetSmartcardConfig \n
  *  CR2         STOP           LL_USART_SetSmartcardConfig \n
  *  CR3         SCEN           LL_USART_SetSmartcardConfig \n
  *  CR3         SCARCNT        LL_USART_SetSmartcardConfig \n
  *  CR3         NACK           LL_USART_SetSmartcardConfig
  * @param  p_usart USART Instance
  * @param  stop_bits This parameter can be one of the following values:
  *         @arg @ref LL_USART_STOP_BIT_0_5
  *         @arg @ref LL_USART_STOP_BIT_1_5
  * @param  first_bit This parameter can be one of the following values:
  *         @arg @ref LL_USART_BITORDER_LSB_FIRST
  *         @arg @ref LL_USART_BITORDER_MSB_FIRST
  * @param  parity This parameter can be one of the following values:
  *         @arg @ref LL_USART_PARITY_NONE
  *         @arg @ref LL_USART_PARITY_EVEN
  *         @arg @ref LL_USART_PARITY_ODD
  * @param  nack This parameter can be 1U(Enable) or 0U(Disable):
  * @param  auto_retry_count Value between Min_Data=0 and Max_Data=7
  */
__STATIC_INLINE void LL_USART_SetSmartcardConfig(USART_TypeDef *p_usart, uint32_t stop_bits, uint32_t first_bit,
                                                 uint32_t parity, uint32_t nack, uint32_t auto_retry_count)
{
  STM32_MODIFY_REG(p_usart->CR1, (USART_CR1_M0 | USART_CR1_M1 | USART_CR1_PCE | USART_CR1_PS | USART_CR1_OVER8),
                   (parity | LL_USART_DATAWIDTH_9_BIT | LL_USART_OVERSAMPLING_16 | USART_CR1_PCE));

