MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_usart.h
  STM32_MODIFY_REG(p_usart->CR2, (USART_CR2_STOP | USART_CR2_MSBFIRST), (first_bit | stop_bits));
  STM32_MODIFY_REG(p_usart->CR3, (USART_CR3_SCEN | USART_CR3_SCARCNT | USART_CR3_NACK),
                   ((nack << USART_CR3_NACK_Pos) | (auto_retry_count << USART_CR3_SCARCNT_Pos) | USART_CR3_SCEN));
}

/**
  * @brief  Configure the USART instance clock for Smartcard.
  * @rmtoll
  *  CR2         LBCL           LL_USART_SetSmartcardClockConfig \n
  *  CR2         CLKEN          LL_USART_SetSmartcardClockConfig \n
  *  CR2         CPHA           LL_USART_SetSmartcardClockConfig \n
  *  CR2         CPOL           LL_USART_SetSmartcardClockConfig
  * @param  p_usart USART Instance
  * @param  clock_output This parameter can be one of the following values:
  *         @arg @ref LL_USART_CLOCK_OUTPUT_ENABLED
  *         @arg @ref LL_USART_CLOCK_OUTPUT_DISABLED
  * @param  clock_polarity This parameter can be one of the following values:
  *         @arg @ref LL_USART_CLOCK_POLARITY_LOW
  *         @arg @ref LL_USART_CLOCK_POLARITY_HIGH
  * @param  clock_phase This parameter can be one of the following values:
  *         @arg @ref LL_USART_CLOCK_PHASE_1_EDGE
  *         @arg @ref LL_USART_CLOCK_PHASE_2_EDGE
  */
__STATIC_INLINE void LL_USART_SetSmartcardClockConfig(USART_TypeDef *p_usart, uint32_t clock_output,
                                                      uint32_t clock_polarity, uint32_t clock_phase)
{
  STM32_MODIFY_REG(p_usart->CR2, (USART_CR2_LBCL | USART_CR2_CLKEN | USART_CR2_CPHA | USART_CR2_CPOL),
                   (clock_output | clock_polarity | clock_phase | USART_CR2_LBCL));
}


/**
  * @brief  Receiver Enable (Receiver is enabled and begins searching for a start bit).
  * @rmtoll
  *  CR1          RE            LL_USART_EnableDirectionRx
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_EnableDirectionRx(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR1, USART_CR1_RE);
}

/**
  * @brief  Receiver Disable.
  * @rmtoll
  *  CR1          RE            LL_USART_DisableDirectionRx
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_DisableDirectionRx(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR1, USART_CR1_RE);
}

/**
  * @brief  Indicate if the p_usart Receiver is enabled.
  * @rmtoll
  *  CR1          RE            LL_USART_IsEnabledDirectionRx
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledDirectionRx(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR1, USART_CR1_RE) == (USART_CR1_RE));
}

/**
  * @brief  Transmitter Enable.
  * @rmtoll
  *  CR1          TE            LL_USART_EnableDirectionTx
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_EnableDirectionTx(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR1, USART_CR1_TE);
}

/**
  * @brief  Transmitter Disable.
  * @rmtoll
  *  CR1          TE            LL_USART_DisableDirectionTx
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_DisableDirectionTx(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR1, USART_CR1_TE);
}

/**
  * @brief  Indicate if the p_usart Transmitter is enabled.
  * @rmtoll
  *  CR1          TE            LL_USART_IsEnabledDirectionTx
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledDirectionTx(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR1, USART_CR1_TE) == (USART_CR1_TE));
}

/**
  * @brief  Configure simultaneously enabled/disabled states
  *         of Transmitter and Receiver.
  * @rmtoll
  *  CR1          RE            LL_USART_SetTransferDirection \n
  *  CR1          TE            LL_USART_SetTransferDirection
  * @param  p_usart USART Instance
  * @param  transfer_direction This parameter can be one of the following values:
  *         @arg @ref LL_USART_DIRECTION_NONE
  *         @arg @ref LL_USART_DIRECTION_RX
  *         @arg @ref LL_USART_DIRECTION_TX
  *         @arg @ref LL_USART_DIRECTION_TX_RX
  */
__STATIC_INLINE void LL_USART_SetTransferDirection(USART_TypeDef *p_usart, uint32_t transfer_direction)
{
  STM32_ATOMIC_MODIFY_REG_32(p_usart->CR1, USART_CR1_RE | USART_CR1_TE, transfer_direction);
}

/**
  * @brief  Return enabled/disabled states of Transmitter and Receiver.
  * @rmtoll
  *  CR1          RE            LL_USART_GetTransferDirection \n
  *  CR1          TE            LL_USART_GetTransferDirection
  * @param  p_usart USART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_DIRECTION_NONE
  *         @arg @ref LL_USART_DIRECTION_RX
  *         @arg @ref LL_USART_DIRECTION_TX
  *         @arg @ref LL_USART_DIRECTION_TX_RX
  */
__STATIC_INLINE uint32_t LL_USART_GetTransferDirection(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR1, USART_CR1_RE | USART_CR1_TE));
}

/**
  * @brief  Configure Parity (enabled/disabled and parity mode if enabled).osition
  *         (9th or 8th bit depending on data width) and parity is checked on the received data.
  * @rmtoll
  *  CR1          PS            LL_USART_SetParity \n
  *  CR1          PCE           LL_USART_SetParity
  * @param  p_usart USART Instance
  * @param  parity This parameter can be one of the following values:
  *         @arg @ref LL_USART_PARITY_NONE
  *         @arg @ref LL_USART_PARITY_EVEN
  *         @arg @ref LL_USART_PARITY_ODD
  * @note   This function selects if hardware parity control (generation and detection) is enabled or disabled.
  *         When the parity control is enabled (Odd or Even), computed parity bit is inserted at the MSB p
  */
__STATIC_INLINE void LL_USART_SetParity(USART_TypeDef *p_usart, uint32_t parity)
{
  STM32_MODIFY_REG(p_usart->CR1, USART_CR1_PS | USART_CR1_PCE, parity);
}

/**
  * @brief  Return Parity configuration (enabled/disabled and parity mode if enabled).
  * @rmtoll
  *  CR1          PS            LL_USART_GetParity \n
  *  CR1          PCE           LL_USART_GetParity
  * @param  p_usart USART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_PARITY_NONE
  *         @arg @ref LL_USART_PARITY_EVEN
  *         @arg @ref LL_USART_PARITY_ODD
  */
__STATIC_INLINE uint32_t LL_USART_GetParity(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR1, USART_CR1_PS | USART_CR1_PCE));
}

/**
  * @brief  Set Receiver Wake Up method from Mute mode.
  * @rmtoll
  *  CR1          WAKE          LL_USART_SetWakeUpMethod
  * @param  p_usart USART Instance
  * @param  method This parameter can be one of the following values:
  *         @arg @ref LL_USART_WAKEUP_METHOD_IDLE_LINE
  *         @arg @ref LL_USART_WAKEUP_METHOD_ADDRESS_MARK
  */
__STATIC_INLINE void LL_USART_SetWakeUpMethod(USART_TypeDef *p_usart, uint32_t method)
{
  STM32_MODIFY_REG(p_usart->CR1, USART_CR1_WAKE, method);
}

/**
  * @brief  Return Receiver Wake Up method from Mute mode.
  * @rmtoll
  *  CR1          WAKE          LL_USART_GetWakeUpMethod
  * @param  p_usart USART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_WAKEUP_METHOD_IDLE_LINE
  *         @arg @ref LL_USART_WAKEUP_METHOD_ADDRESS_MARK
  */
__STATIC_INLINE uint32_t LL_USART_GetWakeUpMethod(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR1, USART_CR1_WAKE));
}

/**
  * @brief  Set Word length (e.g. nb of data bits, excluding start and stop bits).
  * @rmtoll
  *  CR1          M0            LL_USART_SetDataWidth \n
  *  CR1          M1            LL_USART_SetDataWidth
  * @param  p_usart USART Instance
  * @param  data_width This parameter can be one of the following values:
  *         @arg @ref LL_USART_DATAWIDTH_7_BIT
  *         @arg @ref LL_USART_DATAWIDTH_8_BIT
  *         @arg @ref LL_USART_DATAWIDTH_9_BIT
  */
__STATIC_INLINE void LL_USART_SetDataWidth(USART_TypeDef *p_usart, uint32_t data_width)
{
  STM32_MODIFY_REG(p_usart->CR1, USART_CR1_M, data_width);
}

/**
  * @brief  Return Word length (e.g. nb of data bits, excluding start and stop bits).
  * @rmtoll
  *  CR1          M0            LL_USART_GetDataWidth \n
  *  CR1          M1            LL_USART_GetDataWidth
  * @param  p_usart USART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_DATAWIDTH_7_BIT
  *         @arg @ref LL_USART_DATAWIDTH_8_BIT
  *         @arg @ref LL_USART_DATAWIDTH_9_BIT
  */
__STATIC_INLINE uint32_t LL_USART_GetDataWidth(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR1, USART_CR1_M));
}

/**
  * @brief  Allow switch between Mute Mode and Active mode.
  * @rmtoll
  *  CR1          MME           LL_USART_EnableMuteMode
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_EnableMuteMode(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR1, USART_CR1_MME);
}

/**
  * @brief  Prevent Mute Mode use. Set Receiver in active mode permanently.
  * @rmtoll
  *  CR1          MME           LL_USART_DisableMuteMode
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_DisableMuteMode(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR1, USART_CR1_MME);
}

/**
  * @brief  Indicate if switch between Mute Mode and Active mode is allowed.
  * @rmtoll
  *  CR1          MME           LL_USART_IsEnabledMuteMode
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledMuteMode(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR1, USART_CR1_MME) == (USART_CR1_MME)) ? 1UL : 0UL);
}

/**
  * @brief  Set Oversampling to 8-bit or 16-bit mode.
  * @rmtoll
  *  CR1          OVER8         LL_USART_SetOverSampling
  * @param  p_usart USART Instance
  * @param  over_sampling This parameter can be one of the following values:
  *         @arg @ref LL_USART_OVERSAMPLING_16
  *         @arg @ref LL_USART_OVERSAMPLING_8
  */
__STATIC_INLINE void LL_USART_SetOverSampling(USART_TypeDef *p_usart, uint32_t over_sampling)
{
  STM32_MODIFY_REG(p_usart->CR1, USART_CR1_OVER8, over_sampling);
}

/**
  * @brief  Return Oversampling mode.
  * @rmtoll
  *  CR1          OVER8         LL_USART_GetOverSampling
  * @param  p_usart USART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_OVERSAMPLING_16
  *         @arg @ref LL_USART_OVERSAMPLING_8
  */
__STATIC_INLINE uint32_t LL_USART_GetOverSampling(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR1, USART_CR1_OVER8));
}

/**
  * @brief  Configure if Clock pulse of the last data bit is output to the SCLK pin or not.
  * @rmtoll
  *  CR2          LBCL          LL_USART_SetLastClkPulseOutput
  * @param  p_usart USART Instance
  * @param  last_bit_clock_pulse This parameter can be one of the following values:
  *         @arg @ref LL_USART_LASTCLKPULSE_DISABLED
  *         @arg @ref LL_USART_LASTCLKPULSE_ENABLED
  * @note   Macro IS_USART_INSTANCE(p_usart) can be used to check whether or not
  *         Synchronous mode is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_SetLastClkPulseOutput(USART_TypeDef *p_usart, uint32_t last_bit_clock_pulse)
{
  STM32_MODIFY_REG(p_usart->CR2, USART_CR2_LBCL, last_bit_clock_pulse);
}

/**
  * @brief  Retrieve Clock pulse of the last data bit output configuration
  *         (Last bit Clock pulse output to the SCLK pin or not).
  * @rmtoll
  *  CR2          LBCL          LL_USART_GetLastClkPulseOutput
  * @param  p_usart USART Instance
  * @note   Macro IS_USART_INSTANCE(p_usart) can be used to check whether or not
  *         Synchronous mode is supported by the p_usart instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_LASTCLKPULSE_DISABLED
  *         @arg @ref LL_USART_LASTCLKPULSE_ENABLED
  */
__STATIC_INLINE uint32_t LL_USART_GetLastClkPulseOutput(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR2, USART_CR2_LBCL));
}

/**
  * @brief  Select the phase of the clock output on the SCLK pin in synchronous mode.
  * @rmtoll
  *  CR2          CPHA          LL_USART_SetClockPhase
  * @param  p_usart USART Instance
  * @param  clock_phase This parameter can be one of the following values:
  *         @arg @ref LL_USART_CLOCK_PHASE_1_EDGE
  *         @arg @ref LL_USART_CLOCK_PHASE_2_EDGE
  * @note   Macro IS_USART_INSTANCE(p_usart) can be used to check whether or not
  *         Synchronous mode is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_SetClockPhase(USART_TypeDef *p_usart, uint32_t clock_phase)
{
  STM32_MODIFY_REG(p_usart->CR2, USART_CR2_CPHA, clock_phase);
}

/**
  * @brief  Return phase of the clock output on the SCLK pin in synchronous mode.
  * @rmtoll
  *  CR2          CPHA          LL_USART_GetClockPhase
  * @param  p_usart USART Instance
  * @note   Macro IS_USART_INSTANCE(p_usart) can be used to check whether or not
  *         Synchronous mode is supported by the p_usart instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_CLOCK_PHASE_1_EDGE
  *         @arg @ref LL_USART_CLOCK_PHASE_2_EDGE
  */
__STATIC_INLINE uint32_t LL_USART_GetClockPhase(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR2, USART_CR2_CPHA));
}

/**
  * @brief  Select the polarity of the clock output on the SCLK pin in synchronous mode.
  * @rmtoll
  *  CR2          CPOL          LL_USART_SetClockPolarity
  * @param  p_usart USART Instance
  * @param  clock_polarity This parameter can be one of the following values:
  *         @arg @ref LL_USART_CLOCK_POLARITY_LOW
  *         @arg @ref LL_USART_CLOCK_POLARITY_HIGH
  * @note   Macro IS_USART_INSTANCE(p_usart) can be used to check whether or not
  *         Synchronous mode is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_SetClockPolarity(USART_TypeDef *p_usart, uint32_t clock_polarity)
{
  STM32_MODIFY_REG(p_usart->CR2, USART_CR2_CPOL, clock_polarity);
}

/**
  * @brief  Return polarity of the clock output on the SCLK pin in synchronous mode.
  * @rmtoll
  *  CR2          CPOL          LL_USART_GetClockPolarity
  * @param  p_usart USART Instance
  * @note   Macro IS_USART_INSTANCE(p_usart) can be used to check whether or not
  *         Synchronous mode is supported by the p_usart instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_CLOCK_POLARITY_LOW
  *         @arg @ref LL_USART_CLOCK_POLARITY_HIGH
  */
__STATIC_INLINE uint32_t LL_USART_GetClockPolarity(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR2, USART_CR2_CPOL));
}

/**
  * @brief  Configure Clock signal format (Phase Polarity and choice about output of last bit clock pulse).
  * @rmtoll
  *  CR2          CPHA          LL_USART_ConfigClock \n
  *  CR2          CPOL          LL_USART_ConfigClock \n
  *  CR2          LBCL          LL_USART_ConfigClock
  * @param  p_usart USART Instance
  * @param  phase This parameter can be one of the following values:
  *         @arg @ref LL_USART_CLOCK_PHASE_1_EDGE
  *         @arg @ref LL_USART_CLOCK_PHASE_2_EDGE
  * @param  polarity This parameter can be one of the following values:
  *         @arg @ref LL_USART_CLOCK_POLARITY_LOW
  *         @arg @ref LL_USART_CLOCK_POLARITY_HIGH
  * @param  lbcp_output This parameter can be one of the following values:
  *         @arg @ref LL_USART_LASTCLKPULSE_DISABLED
  *         @arg @ref LL_USART_LASTCLKPULSE_ENABLED
  * @note   Macro IS_USART_INSTANCE(p_usart) can be used to check whether or not
  *         Synchronous mode is supported by the p_usart instance.
  * @note   Call of this function is equivalent to following function call sequence :
  *         - Clock Phase configuration using @ref LL_USART_SetClockPhase() function
  *         - Clock Polarity configuration using @ref LL_USART_SetClockPolarity() function
  *         - Output of Last bit Clock pulse configuration using @ref LL_USART_SetLastClkPulseOutput() function
  */
__STATIC_INLINE void LL_USART_ConfigClock(USART_TypeDef *p_usart, uint32_t phase, uint32_t polarity,
                                          uint32_t lbcp_output)
{
  STM32_MODIFY_REG(p_usart->CR2, USART_CR2_CPHA | USART_CR2_CPOL | USART_CR2_LBCL, phase | polarity | lbcp_output);
}

/**
  * @brief  Configure Clock source prescaler for the baud rate generator and oversampling.
  * @rmtoll
  *  PRESC        PRESCALER     LL_USART_SetPrescaler
  * @param  p_usart USART Instance
  * @param  prescaler_value This parameter can be one of the following values:
  *         @arg @ref LL_USART_PRESCALER_DIV1
  *         @arg @ref LL_USART_PRESCALER_DIV2
  *         @arg @ref LL_USART_PRESCALER_DIV4
  *         @arg @ref LL_USART_PRESCALER_DIV6
  *         @arg @ref LL_USART_PRESCALER_DIV8
  *         @arg @ref LL_USART_PRESCALER_DIV10
  *         @arg @ref LL_USART_PRESCALER_DIV12
  *         @arg @ref LL_USART_PRESCALER_DIV16
  *         @arg @ref LL_USART_PRESCALER_DIV32
  *         @arg @ref LL_USART_PRESCALER_DIV64
  *         @arg @ref LL_USART_PRESCALER_DIV128
  *         @arg @ref LL_USART_PRESCALER_DIV256
  * @note   Use macro IS_UART_FIFO_INSTANCE(p_usart) to check whether
  *         the FIFO mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_SetPrescaler(USART_TypeDef *p_usart, uint32_t prescaler_value)
{
  STM32_MODIFY_REG(p_usart->PRESC, USART_PRESC_PRESCALER, (uint16_t)prescaler_value);
}

/**
  * @brief  Retrieve the Clock source prescaler for the baud rate generator and oversampling.
  * @rmtoll
  *  PRESC        PRESCALER     LL_USART_GetPrescaler
  * @param  p_usart USART Instance
  * @note   Use macro IS_UART_FIFO_INSTANCE(p_usart) to check whether
  *         the FIFO mode feature is supported by the p_usart instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_PRESCALER_DIV1
  *         @arg @ref LL_USART_PRESCALER_DIV2
  *         @arg @ref LL_USART_PRESCALER_DIV4
  *         @arg @ref LL_USART_PRESCALER_DIV6
  *         @arg @ref LL_USART_PRESCALER_DIV8
  *         @arg @ref LL_USART_PRESCALER_DIV10
  *         @arg @ref LL_USART_PRESCALER_DIV12
  *         @arg @ref LL_USART_PRESCALER_DIV16
  *         @arg @ref LL_USART_PRESCALER_DIV32
  *         @arg @ref LL_USART_PRESCALER_DIV64
  *         @arg @ref LL_USART_PRESCALER_DIV128
  *         @arg @ref LL_USART_PRESCALER_DIV256
  */
__STATIC_INLINE uint32_t LL_USART_GetPrescaler(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->PRESC, USART_PRESC_PRESCALER));
}

/**
  * @brief  Enable Clock output on SCLK pin.
  * @rmtoll
  *  CR2          CLKEN         LL_USART_EnableSCLKOutput
  * @param  p_usart USART Instance
  * @note   Macro IS_USART_INSTANCE(p_usart) can be used to check whether or not
  *         Synchronous mode is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableSCLKOutput(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->CR2, USART_CR2_CLKEN);
}

/**
  * @brief  Disable Clock output on SCLK pin.
  * @rmtoll
  *  CR2          CLKEN         LL_USART_DisableSCLKOutput
  * @param  p_usart USART Instance
  * @note   Macro IS_USART_INSTANCE(p_usart) can be used to check whether or not
  *         Synchronous mode is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableSCLKOutput(USART_TypeDef *p_usart)
{
  STM32_CLEAR_BIT(p_usart->CR2, USART_CR2_CLKEN);
}

/**
  * @brief  Indicate if Clock output on SCLK pin is enabled.
  * @rmtoll
  *  CR2          CLKEN         LL_USART_IsEnabledSCLKOutput
  * @param  p_usart USART Instance
  * @note   Macro IS_USART_INSTANCE(p_usart) can be used to check whether or not
  *         Synchronous mode is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledSCLKOutput(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR2, USART_CR2_CLKEN) == (USART_CR2_CLKEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set the length of the stop bits.
  * @rmtoll
  *  CR2          STOP          LL_USART_SetStopBitsLength
  * @param  p_usart USART Instance
  * @param  stop_bits This parameter can be one of the following values:
  *         @arg @ref LL_USART_STOP_BIT_0_5
  *         @arg @ref LL_USART_STOP_BIT_1
  *         @arg @ref LL_USART_STOP_BIT_1_5
  *         @arg @ref LL_USART_STOP_BIT_2
  */
__STATIC_INLINE void LL_USART_SetStopBitsLength(USART_TypeDef *p_usart, uint32_t stop_bits)
{
  STM32_MODIFY_REG(p_usart->CR2, USART_CR2_STOP, stop_bits);
}

/**
  * @brief  Retrieve the length of the stop bits.
  * @rmtoll
  *  CR2          STOP          LL_USART_GetStopBitsLength
  * @param  p_usart USART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_STOP_BIT_0_5
  *         @arg @ref LL_USART_STOP_BIT_1
  *         @arg @ref LL_USART_STOP_BIT_1_5
  *         @arg @ref LL_USART_STOP_BIT_2
  */
__STATIC_INLINE uint32_t LL_USART_GetStopBitsLength(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR2, USART_CR2_STOP));
}

/**
  * @brief  Configure Character frame format (Datawidth, Parity control, Stop Bits).
  * @rmtoll
  *  CR1          PS            LL_USART_ConfigCharacter \n
  *  CR1          PCE           LL_USART_ConfigCharacter \n
  *  CR1          M0            LL_USART_ConfigCharacter \n
  *  CR1          M1            LL_USART_ConfigCharacter \n
  *  CR2          STOP          LL_USART_ConfigCharacter
  * @param  p_usart USART Instance
  * @param  data_width This parameter can be one of the following values:
  *         @arg @ref LL_USART_DATAWIDTH_7_BIT
  *         @arg @ref LL_USART_DATAWIDTH_8_BIT
  *         @arg @ref LL_USART_DATAWIDTH_9_BIT
  * @param  parity This parameter can be one of the following values:
  *         @arg @ref LL_USART_PARITY_NONE
  *         @arg @ref LL_USART_PARITY_EVEN
  *         @arg @ref LL_USART_PARITY_ODD
  * @param  stop_bits This parameter can be one of the following values:
  *         @arg @ref LL_USART_STOP_BIT_0_5
  *         @arg @ref LL_USART_STOP_BIT_1
  *         @arg @ref LL_USART_STOP_BIT_1_5
  *         @arg @ref LL_USART_STOP_BIT_2
  * @note   Call of this function is equivalent to following function call sequence :
  *         - Data Width configuration using @ref LL_USART_SetDataWidth() function
  *         - Parity Control and mode configuration using @ref LL_USART_SetParity() function
  *         - Stop bits configuration using @ref LL_USART_SetStopBitsLength() function
  */
__STATIC_INLINE void LL_USART_ConfigCharacter(USART_TypeDef *p_usart, uint32_t data_width, uint32_t parity,
                                              uint32_t stop_bits)
{
  STM32_MODIFY_REG(p_usart->CR1, USART_CR1_PS | USART_CR1_PCE | USART_CR1_M, parity | data_width);
  STM32_MODIFY_REG(p_usart->CR2, USART_CR2_STOP, stop_bits);
}

/**
  * @brief  Configure TX/RX pins swapping setting.
  * @rmtoll
  *  CR2          SWAP          LL_USART_SetTXRXSwap
  * @param  p_usart USART Instance
  * @param  swap_config This parameter can be one of the following values:
  *         @arg @ref LL_USART_TXRX_STANDARD
  *         @arg @ref LL_USART_TXRX_SWAPPED
  */
__STATIC_INLINE void LL_USART_SetTXRXSwap(USART_TypeDef *p_usart, uint32_t swap_config)
{
  STM32_MODIFY_REG(p_usart->CR2, USART_CR2_SWAP, swap_config);
}

