MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_usart.h
/**
  * @brief  Retrieve TX/RX pins swapping configuration.
  * @rmtoll
  *  CR2          SWAP          LL_USART_GetTXRXSwap
  * @param  p_usart USART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_TXRX_STANDARD
  *         @arg @ref LL_USART_TXRX_SWAPPED
  */
__STATIC_INLINE uint32_t LL_USART_GetTXRXSwap(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR2, USART_CR2_SWAP));
}

/**
  * @brief  Configure RX pin active level logic.
  * @rmtoll
  *  CR2          RXINV         LL_USART_SetRXPinLevel
  * @param  p_usart USART Instance
  * @param  pin_inv_method This parameter can be one of the following values:
  *         @arg @ref LL_USART_RXPIN_LEVEL_STANDARD
  *         @arg @ref LL_USART_RXPIN_LEVEL_INVERTED
  */
__STATIC_INLINE void LL_USART_SetRXPinLevel(USART_TypeDef *p_usart, uint32_t pin_inv_method)
{
  STM32_MODIFY_REG(p_usart->CR2, USART_CR2_RXINV, pin_inv_method);
}

/**
  * @brief  Retrieve RX pin active level logic configuration.
  * @rmtoll
  *  CR2          RXINV         LL_USART_GetRXPinLevel
  * @param  p_usart USART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_RXPIN_LEVEL_STANDARD
  *         @arg @ref LL_USART_RXPIN_LEVEL_INVERTED
  */
__STATIC_INLINE uint32_t LL_USART_GetRXPinLevel(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR2, USART_CR2_RXINV));
}

/**
  * @brief  Configure TX pin active level logic.
  * @rmtoll
  *  CR2          TXINV         LL_USART_SetTXPinLevel
  * @param  p_usart USART Instance
  * @param  pin_inv_method This parameter can be one of the following values:
  *         @arg @ref LL_USART_TXPIN_LEVEL_STANDARD
  *         @arg @ref LL_USART_TXPIN_LEVEL_INVERTED
  */
__STATIC_INLINE void LL_USART_SetTXPinLevel(USART_TypeDef *p_usart, uint32_t pin_inv_method)
{
  STM32_MODIFY_REG(p_usart->CR2, USART_CR2_TXINV, pin_inv_method);
}

/**
  * @brief  Retrieve TX pin active level logic configuration.
  * @rmtoll
  *  CR2          TXINV         LL_USART_GetTXPinLevel
  * @param  p_usart USART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_TXPIN_LEVEL_STANDARD
  *         @arg @ref LL_USART_TXPIN_LEVEL_INVERTED
  */
__STATIC_INLINE uint32_t LL_USART_GetTXPinLevel(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR2, USART_CR2_TXINV));
}

/**
  * @brief  Configure Binary data logic.
  * @rmtoll
  *  CR2          DATAINV       LL_USART_SetBinaryDataLogic
  * @param  p_usart USART Instance
  * @param  data_logic This parameter can be one of the following values:
  *         @arg @ref LL_USART_BINARY_LOGIC_POSITIVE
  *         @arg @ref LL_USART_BINARY_LOGIC_NEGATIVE
  * @note   Allow to define how Logical data from the data register are send/received :
  *         either in positive/direct logic (1=H, 0=L) or in negative/inverse logic (1=L, 0=H)
  */
__STATIC_INLINE void LL_USART_SetBinaryDataLogic(USART_TypeDef *p_usart, uint32_t data_logic)
{
  STM32_MODIFY_REG(p_usart->CR2, USART_CR2_DATAINV, data_logic);
}

/**
  * @brief  Retrieve Binary data configuration.
  * @rmtoll
  *  CR2          DATAINV       LL_USART_GetBinaryDataLogic
  * @param  p_usart USART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_BINARY_LOGIC_POSITIVE
  *         @arg @ref LL_USART_BINARY_LOGIC_NEGATIVE
  */
__STATIC_INLINE uint32_t LL_USART_GetBinaryDataLogic(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR2, USART_CR2_DATAINV));
}

/**
  * @brief  Configure transfer bit order (either Less or Most Significant Bit First).
  * @rmtoll
  *  CR2          MSBFIRST      LL_USART_SetTransferBitOrder
  * @param  p_usart USART Instance
  * @param  bit_order This parameter can be one of the following values:
  *         @arg @ref LL_USART_BITORDER_LSB_FIRST
  *         @arg @ref LL_USART_BITORDER_MSB_FIRST
  * @note   MSB First means data is transmitted/received with the MSB first, following the start bit.
  *         LSB First means data is transmitted/received with data bit 0 first, following the start bit.
  */
__STATIC_INLINE void LL_USART_SetTransferBitOrder(USART_TypeDef *p_usart, uint32_t bit_order)
{
  STM32_MODIFY_REG(p_usart->CR2, USART_CR2_MSBFIRST, bit_order);
}

/**
  * @brief  Return transfer bit order (either Less or Most Significant Bit First).
  * @rmtoll
  *  CR2          MSBFIRST      LL_USART_GetTransferBitOrder
  * @param  p_usart USART Instance
  * @note   MSB First means data is transmitted/received with the MSB first, following the start bit.
  *         LSB First means data is transmitted/received with data bit 0 first, following the start bit.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_BITORDER_LSB_FIRST
  *         @arg @ref LL_USART_BITORDER_MSB_FIRST
  */
__STATIC_INLINE uint32_t LL_USART_GetTransferBitOrder(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR2, USART_CR2_MSBFIRST));
}

/**
  * @brief  Enable Auto Baud-Rate Detection.
  * @rmtoll
  *  CR2          ABREN         LL_USART_EnableAutoBaudRate
  * @param  p_usart USART Instance
  * @note   Macro IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(p_usart) can be used to check whether or not
  *         Auto Baud Rate detection feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableAutoBaudRate(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->CR2, USART_CR2_ABREN);
}

/**
  * @brief  Disable Auto Baud-Rate Detection.
  * @rmtoll
  *  CR2          ABREN         LL_USART_DisableAutoBaudRate
  * @param  p_usart USART Instance
  * @note   Macro IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(p_usart) can be used to check whether or not
  *         Auto Baud Rate detection feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableAutoBaudRate(USART_TypeDef *p_usart)
{
  STM32_CLEAR_BIT(p_usart->CR2, USART_CR2_ABREN);
}

/**
  * @brief  Indicate if Auto Baud-Rate Detection mechanism is enabled.
  * @rmtoll
  *  CR2          ABREN         LL_USART_IsEnabledAutoBaud
  * @param  p_usart USART Instance
  * @note   Macro IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(p_usart) can be used to check whether or not
  *         Auto Baud Rate detection feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledAutoBaud(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR2, USART_CR2_ABREN) == (USART_CR2_ABREN)) ? 1UL : 0UL);
}

/**
  * @brief  Set Auto Baud-Rate mode bits.
  * @rmtoll
  *  CR2          ABRMODE       LL_USART_SetAutoBaudRateMode
  * @param  p_usart USART Instance
  * @param  auto_baud_rate_mode This parameter can be one of the following values:
  *         @arg @ref LL_USART_AUTO_BAUD_DETECT_ON_START_BIT
  *         @arg @ref LL_USART_AUTO_BAUD_DETECT_ON_FALLING_EDGE
  *         @arg @ref LL_USART_AUTO_BAUD_DETECT_ON_0X7F_FRAME
  *         @arg @ref LL_USART_AUTO_BAUD_DETECT_ON_0X55_FRAME
  * @note   Macro IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(p_usart) can be used to check whether or not
  *         Auto Baud Rate detection feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_SetAutoBaudRateMode(USART_TypeDef *p_usart, uint32_t auto_baud_rate_mode)
{
  STM32_MODIFY_REG(p_usart->CR2, USART_CR2_ABRMOD, auto_baud_rate_mode);
}

/**
  * @brief  Return Auto Baud-Rate mode.
  * @rmtoll
  *  CR2          ABRMODE       LL_USART_GetAutoBaudRateMode
  * @param  p_usart USART Instance
  * @note   Macro IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(p_usart) can be used to check whether or not
  *         Auto Baud Rate detection feature is supported by the p_usart instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_AUTO_BAUD_DETECT_ON_START_BIT
  *         @arg @ref LL_USART_AUTO_BAUD_DETECT_ON_FALLING_EDGE
  *         @arg @ref LL_USART_AUTO_BAUD_DETECT_ON_0X7F_FRAME
  *         @arg @ref LL_USART_AUTO_BAUD_DETECT_ON_0X55_FRAME
  */
__STATIC_INLINE uint32_t LL_USART_GetAutoBaudRateMode(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR2, USART_CR2_ABRMOD));
}

/**
  * @brief  Enable Receiver Timeout.
  * @rmtoll
  *  CR2          RTOEN         LL_USART_EnableRxTimeout
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_EnableRxTimeout(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->CR2, USART_CR2_RTOEN);
}

/**
  * @brief  Disable Receiver Timeout.
  * @rmtoll
  *  CR2          RTOEN         LL_USART_DisableRxTimeout
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_DisableRxTimeout(USART_TypeDef *p_usart)
{
  STM32_CLEAR_BIT(p_usart->CR2, USART_CR2_RTOEN);
}

/**
  * @brief  Indicate if Receiver Timeout feature is enabled.
  * @rmtoll
  *  CR2          RTOEN         LL_USART_IsEnabledRxTimeout
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledRxTimeout(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR2, USART_CR2_RTOEN) == (USART_CR2_RTOEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set a 8 bit Address of the USART node as set in ADD field of CR2.
  * @rmtoll
  *  CR2          ADD           LL_USART_SetNodeAddress
  * @param  p_usart USART Instance
  * @param  node_address 4 or 7 bit Address of the USART node.
  * @note   If 4-bit Address Detection is selected in ADDM7,
  *         only 4bits (b3-b0) of returned value are relevant (b31-b4 are not relevant)
  *         If 7-bit Address Detection is selected in ADDM7,
  *         only 8bits (b7-b0) of returned value are relevant (b31-b8 are not relevant)
  */
__STATIC_INLINE void LL_USART_SetNodeAddress(USART_TypeDef *p_usart, uint32_t node_address)
{
  STM32_MODIFY_REG(p_usart->CR2, USART_CR2_ADD, (node_address << USART_CR2_ADD_Pos));
}

/**
  * @brief  Set the Address length of the USART node in ADDM7 field of CR2.
  * @rmtoll
  *  CR2          ADDM7           LL_USART_SetNodeAddressLength
  * @param  p_usart USART Instance
  * @param  address_len This parameter can be one of the following values:
  *         @arg @ref LL_USART_ADDRESS_DETECT_4_BIT
  *         @arg @ref LL_USART_ADDRESS_DETECT_7_BIT
  * @note   If 4-bit Address Detection is selected in ADDM7,
  *         only 4bits (b3-b0) of returned value are relevant (b31-b4 are not relevant)
  *         If 7-bit Address Detection is selected in ADDM7,
  *         only 8bits (b7-b0) of returned value are relevant (b31-b8 are not relevant)
  */
__STATIC_INLINE void LL_USART_SetNodeAddressLength(USART_TypeDef *p_usart, uint32_t address_len)
{
  STM32_MODIFY_REG(p_usart->CR2, USART_CR2_ADDM7, address_len);
}

/**
  * @brief  Configure Address and Address length of the USART node.
  * @rmtoll
  *  CR2          ADD           LL_USART_ConfigNodeAddress \n
  *  CR2          ADDM7         LL_USART_ConfigNodeAddress
  * @param  p_usart USART Instance
  * @param  address_len This parameter can be one of the following values:
  *         @arg @ref LL_USART_ADDRESS_DETECT_4_BIT
  *         @arg @ref LL_USART_ADDRESS_DETECT_7_BIT
  * @param  node_address 4 or 7 bit Address of the USART node.
  * @note   This is used in multiprocessor communication during Mute mode or Stop mode,
  *         for wake up with address mark detection.
  * @note   4bits address node is used when 4-bit Address Detection is selected in ADDM7.
  *         (b7-b4 must be set to 0)
  *         8bits address node is used when 7-bit Address Detection is selected in ADDM7.
  *         (This is used in multiprocessor communication during Mute mode or Stop mode,
  *         for wake up with 7-bit address mark detection.
  *         The MSB of the character sent by the transmitter must be equal to 1.
  *         It can also be used for character detection during normal reception,
  *         Mute mode inactive (for example, end of block detection in ModBus protocol).
  *         In this case, the whole received character (8-bit) is compared to the ADD[7:0]
  *         value and CMF flag is set on match)
  */
__STATIC_INLINE void LL_USART_ConfigNodeAddress(USART_TypeDef *p_usart, uint32_t address_len, uint32_t node_address)
{
  STM32_MODIFY_REG(p_usart->CR2, USART_CR2_ADD | USART_CR2_ADDM7,
                   (uint32_t)(address_len | (node_address << USART_CR2_ADD_Pos)));
}

/**
  * @brief  Return 8 bit Address of the USART node as set in ADD field of CR2.
  * @rmtoll
  *  CR2          ADD           LL_USART_GetNodeAddress
  * @param  p_usart USART Instance
  * @note   If 4-bit Address Detection is selected in ADDM7,
  *         only 4bits (b3-b0) of returned value are relevant (b31-b4 are not relevant)
  *         If 7-bit Address Detection is selected in ADDM7,
  *         only 8bits (b7-b0) of returned value are relevant (b31-b8 are not relevant)
  * @retval Address of the USART node (Value between Min_Data=0 and Max_Data=255)
  */
__STATIC_INLINE uint32_t LL_USART_GetNodeAddress(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR2, USART_CR2_ADD) >> USART_CR2_ADD_Pos);
}

/**
  * @brief  Return Length of Node Address used in Address Detection mode (7-bit or 4-bit).
  * @rmtoll
  *  CR2          ADDM7         LL_USART_GetNodeAddressLength
  * @param  p_usart USART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_ADDRESS_DETECT_4_BIT
  *         @arg @ref LL_USART_ADDRESS_DETECT_7_BIT
  */
__STATIC_INLINE uint32_t LL_USART_GetNodeAddressLength(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR2, USART_CR2_ADDM7));
}

/**
  * @brief  Enable RTS HW Flow Control.
  * @rmtoll
  *  CR3          RTSE          LL_USART_EnableRTSHWFlowCtrl
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_HWFLOW_INSTANCE(p_usart) can be used to check whether or not
  *         Hardware Flow control feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableRTSHWFlowCtrl(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR3, USART_CR3_RTSE);
}

/**
  * @brief  Disable RTS HW Flow Control.
  * @rmtoll
  *  CR3          RTSE          LL_USART_DisableRTSHWFlowCtrl
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_HWFLOW_INSTANCE(p_usart) can be used to check whether or not
  *         Hardware Flow control feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableRTSHWFlowCtrl(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR3, USART_CR3_RTSE);
}

/**
  * @brief  Enable CTS HW Flow Control.
  * @rmtoll
  *  CR3          CTSE          LL_USART_EnableCTSHWFlowCtrl
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_HWFLOW_INSTANCE(p_usart) can be used to check whether or not
  *         Hardware Flow control feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableCTSHWFlowCtrl(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR3, USART_CR3_CTSE);
}

/**
  * @brief  Disable CTS HW Flow Control.
  * @rmtoll
  *  CR3          CTSE          LL_USART_DisableCTSHWFlowCtrl
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_HWFLOW_INSTANCE(p_usart) can be used to check whether or not
  *         Hardware Flow control feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableCTSHWFlowCtrl(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR3, USART_CR3_CTSE);
}

/**
  * @brief  Configure HW Flow Control mode (both CTS and RTS).
  * @rmtoll
  *  CR3          RTSE          LL_USART_SetHWFlowCtrl \n
  *  CR3          CTSE          LL_USART_SetHWFlowCtrl
  * @param  p_usart USART Instance
  * @param  hardware_flow_control This parameter can be one of the following values:
  *         @arg @ref LL_USART_HWCONTROL_NONE
  *         @arg @ref LL_USART_HWCONTROL_RTS
  *         @arg @ref LL_USART_HWCONTROL_CTS
  *         @arg @ref LL_USART_HWCONTROL_RTS_CTS
  * @note   Macro IS_UART_HWFLOW_INSTANCE(p_usart) can be used to check whether or not
  *         Hardware Flow control feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_SetHWFlowCtrl(USART_TypeDef *p_usart, uint32_t hardware_flow_control)
{
  STM32_MODIFY_REG(p_usart->CR3, USART_CR3_RTSE | USART_CR3_CTSE, hardware_flow_control);
}

/**
  * @brief  Return HW Flow Control configuration (both CTS and RTS).
  * @rmtoll
  *  CR3          RTSE          LL_USART_GetHWFlowCtrl \n
  *  CR3          CTSE          LL_USART_GetHWFlowCtrl
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_HWFLOW_INSTANCE(p_usart) can be used to check whether or not
  *         Hardware Flow control feature is supported by the p_usart instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_HWCONTROL_NONE
  *         @arg @ref LL_USART_HWCONTROL_RTS
  *         @arg @ref LL_USART_HWCONTROL_CTS
  *         @arg @ref LL_USART_HWCONTROL_RTS_CTS
  */
__STATIC_INLINE uint32_t LL_USART_GetHWFlowCtrl(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR3, USART_CR3_RTSE | USART_CR3_CTSE));
}

/**
  * @brief  Enable One bit sampling method.
  * @rmtoll
  *  CR3          ONEBIT        LL_USART_EnableOneBitSample
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_EnableOneBitSample(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->CR3, USART_CR3_ONEBIT);
}

/**
  * @brief  Disable One bit sampling method.
  * @rmtoll
  *  CR3          ONEBIT        LL_USART_DisableOneBitSample
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_DisableOneBitSample(USART_TypeDef *p_usart)
{
  STM32_CLEAR_BIT(p_usart->CR3, USART_CR3_ONEBIT);
}

/**
  * @brief  Indicate if One bit sampling method is enabled.
  * @rmtoll
  *  CR3          ONEBIT        LL_USART_IsEnabledOneBitSample
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledOneBitSample(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR3, USART_CR3_ONEBIT) == (USART_CR3_ONEBIT)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Overrun detection.
  * @rmtoll
  *  CR3          OVRDIS        LL_USART_EnableOverrunDetect
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_EnableOverrunDetect(USART_TypeDef *p_usart)
{
  STM32_CLEAR_BIT(p_usart->CR3, USART_CR3_OVRDIS);
}

/**
  * @brief  Disable Overrun detection.
  * @rmtoll
  *  CR3          OVRDIS        LL_USART_DisableOverrunDetect
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_DisableOverrunDetect(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->CR3, USART_CR3_OVRDIS);
}

/**
  * @brief  Indicate if Overrun detection is enabled.
  * @rmtoll
  *  CR3          OVRDIS        LL_USART_IsEnabledOverrunDetect
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledOverrunDetect(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR3, USART_CR3_OVRDIS) != USART_CR3_OVRDIS) ? 1UL : 0UL);
}

/**
  * @brief  Select event type for Wake UP Interrupt Flag (WUS[1:0] bits).
  * @rmtoll
  *  CR3          WUS           LL_USART_SetWKUPType
  * @param  p_usart USART Instance
  * @param  Type This parameter can be one of the following values:
  *         @arg @ref LL_USART_WAKEUP_ON_ADDRESS
  *         @arg @ref LL_USART_WAKEUP_ON_STARTBIT
  *         @arg @ref LL_USART_WAKEUP_ON_RXNE
  * @note   Macro IS_UART_WAKEUP_FROMSTOP_INSTANCE(p_usart) can be used to check whether or not
  *         Wake-up from Stop mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_SetWKUPType(USART_TypeDef *p_usart, uint32_t Type)
{
  STM32_MODIFY_REG(p_usart->CR3, USART_CR3_WUS, Type);
}

/**
  * @brief  Return event type for Wake UP Interrupt Flag (WUS[1:0] bits).
  * @rmtoll
  *  CR3          WUS           LL_USART_GetWKUPType
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_WAKEUP_FROMSTOP_INSTANCE(p_usart) can be used to check whether or not
  *         Wake-up from Stop mode feature is supported by the p_usart instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_WAKEUP_ON_ADDRESS
  *         @arg @ref LL_USART_WAKEUP_ON_STARTBIT
  *         @arg @ref LL_USART_WAKEUP_ON_RXNE
  */
__STATIC_INLINE uint32_t LL_USART_GetWKUPType(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR3, USART_CR3_WUS));
}

/**
  * @brief  Configure USART BRR register for achieving expected Baud Rate value.
  * @rmtoll
  *  BRR          BRR           LL_USART_SetBaudRate
  * @param  p_usart USART Instance
  * @param  periph_clk Peripheral Clock
  * @param  prescaler_value This parameter can be one of the following values:
  *         @arg @ref LL_USART_PRESCALER_DIV1
  *         @arg @ref LL_USART_PRESCALER_DIV2
  *         @arg @ref LL_USART_PRESCALER_DIV4
  *         @arg @ref LL_USART_PRESCALER_DIV6
  *         @arg @ref LL_USART_PRESCALER_DIV8
  *         @arg @ref LL_USART_PRESCALER_DIV10
  *         @arg @ref LL_USART_PRESCALER_DIV12
  *         @arg @ref LL_USART_PRESCALER_DIV16
  *         @arg @ref LL_USART_PRESCALER_DIV32
  *         @arg @ref LL_USART_PRESCALER_DIV64
  *         @arg @ref LL_USART_PRESCALER_DIV128
  *         @arg @ref LL_USART_PRESCALER_DIV256
  * @param  over_sampling This parameter can be one of the following values:
  *         @arg @ref LL_USART_OVERSAMPLING_16
  *         @arg @ref LL_USART_OVERSAMPLING_8
  * @param  baud_rate Baud Rate
  * @note   Compute and set USARTDIV value in BRR Register (full BRR content)
  *         according to used Peripheral Clock, Oversampling mode, and expected Baud Rate values
  * @note   Peripheral clock and Baud rate values provided as function parameters must be valid
  *         (Baud rate value != 0)
  * @note   In case of oversampling by 16 and 8, BRR content must be greater than or equal to 16d.
  */
__STATIC_INLINE void LL_USART_SetBaudRate(USART_TypeDef *p_usart, uint32_t periph_clk, uint32_t prescaler_value,
                                          uint32_t over_sampling,
                                          uint32_t baud_rate)
{
  uint32_t usartdiv;
  uint32_t brrtemp;

  if (prescaler_value > LL_USART_PRESCALER_DIV256)
  {
    /* Do not overstep the size of USART_PRESCALER_TAB */
  }
  else if (baud_rate == 0U)
  {
    /* Can Not divide per 0 */
  }
  else if (over_sampling == LL_USART_OVERSAMPLING_8)
  {
    usartdiv = (uint16_t)(LL_USART_DIV_SAMPLING8(periph_clk, (uint8_t)prescaler_value, baud_rate));
    brrtemp = usartdiv & 0xFFF0U;
    brrtemp |= (uint16_t)((usartdiv & (uint16_t)0x000FU) >> 1U);
    p_usart->BRR = brrtemp;
  }
  else
  {
    p_usart->BRR = (uint16_t)(LL_USART_DIV_SAMPLING16(periph_clk, (uint8_t)prescaler_value, baud_rate));
  }
}

