MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_usart.h
/**
  * @brief  Return current Baud Rate value, according to USARTDIV present in BRR register
  *         (full BRR content), and to used Peripheral Clock and Oversampling mode values.
  * @rmtoll
  *  BRR          BRR           LL_USART_GetBaudRate
  * @param  p_usart USART Instance
  * @param  periph_clk Peripheral Clock
  * @param  prescaler_value This parameter can be one of the following values:
  *         @arg @ref LL_USART_PRESCALER_DIV1
  *         @arg @ref LL_USART_PRESCALER_DIV2
  *         @arg @ref LL_USART_PRESCALER_DIV4
  *         @arg @ref LL_USART_PRESCALER_DIV6
  *         @arg @ref LL_USART_PRESCALER_DIV8
  *         @arg @ref LL_USART_PRESCALER_DIV10
  *         @arg @ref LL_USART_PRESCALER_DIV12
  *         @arg @ref LL_USART_PRESCALER_DIV16
  *         @arg @ref LL_USART_PRESCALER_DIV32
  *         @arg @ref LL_USART_PRESCALER_DIV64
  *         @arg @ref LL_USART_PRESCALER_DIV128
  *         @arg @ref LL_USART_PRESCALER_DIV256
  * @param  over_sampling This parameter can be one of the following values:
  *         @arg @ref LL_USART_OVERSAMPLING_16
  *         @arg @ref LL_USART_OVERSAMPLING_8
  * @note   In case of non-initialized or invalid value stored in BRR register, value 0 will be returned.
  * @note   In case of oversampling by 16 and 8, BRR content must be greater than or equal to 16d.
  * @retval Baud Rate
  */
__STATIC_INLINE uint32_t LL_USART_GetBaudRate(const USART_TypeDef *p_usart, uint32_t periph_clk,
                                              uint32_t prescaler_value, uint32_t over_sampling)
{
  uint32_t usartdiv;
  uint32_t brrresult = 0x0U;
  uint32_t periphclkpresc = (uint32_t)(periph_clk / (USART_PRESCALER_TAB[(uint8_t)prescaler_value]));

  usartdiv = p_usart->BRR;

  if (usartdiv == 0U)
  {
    /* Do not perform a division by 0 */
  }
  else if (over_sampling == (uint32_t)LL_USART_OVERSAMPLING_8)
  {
    usartdiv = (uint16_t)((usartdiv & 0xFFF0U) | ((usartdiv & 0x0007U) << 1U)) ;
    if (usartdiv != 0U)
    {
      brrresult = (periphclkpresc * 2U) / usartdiv;
    }
  }
  else
  {
    if ((usartdiv & 0xFFFFU) != 0U)
    {
      brrresult = periphclkpresc / usartdiv;
    }
  }
  return (brrresult);
}

/**
  * @brief  Set Receiver Time Out Value (expressed in nb of bits duration).
  * @rmtoll
  *  RTOR         RTO           LL_USART_SetRxTimeout
  * @param  p_usart USART Instance
  * @param  timeout Value between Min_Data=0x00 and Max_Data=0x00FFFFFF
  */
__STATIC_INLINE void LL_USART_SetRxTimeout(USART_TypeDef *p_usart, uint32_t timeout)
{
  STM32_MODIFY_REG(p_usart->RTOR, USART_RTOR_RTO, timeout);
}

/**
  * @brief  Get Receiver Time Out Value (expressed in nb of bits duration).
  * @rmtoll
  *  RTOR         RTO           LL_USART_GetRxTimeout
  * @param  p_usart USART Instance
  * @retval Value between Min_Data=0x00 and Max_Data=0x00FFFFFF
  */
__STATIC_INLINE uint32_t LL_USART_GetRxTimeout(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->RTOR, USART_RTOR_RTO));
}

/**
  * @brief  Set Block Length value in reception.
  * @rmtoll
  *  RTOR         BLEN          LL_USART_SetBlockLength
  * @param  p_usart USART Instance
  * @param  block_length Value between Min_Data=0x00 and Max_Data=0xFF
  */
__STATIC_INLINE void LL_USART_SetBlockLength(USART_TypeDef *p_usart, uint32_t block_length)
{
  STM32_MODIFY_REG(p_usart->RTOR, USART_RTOR_BLEN, block_length << USART_RTOR_BLEN_Pos);
}

/**
  * @brief  Get Block Length value in reception.
  * @rmtoll
  *  RTOR         BLEN          LL_USART_GetBlockLength
  * @param  p_usart USART Instance
  * @retval Value between Min_Data=0x00 and Max_Data=0xFF
  */
__STATIC_INLINE uint32_t LL_USART_GetBlockLength(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->RTOR, USART_RTOR_BLEN) >> USART_RTOR_BLEN_Pos);
}

/**
  * @}
  */

/** @defgroup USART_LL_EF_Configuration_IRDA Configuration functions related to Irda feature
  * @{
  */

/**
  * @brief  Enable IrDA mode.
  * @rmtoll
  *  CR3          IREN          LL_USART_EnableIrda
  * @param  p_usart USART Instance
  * @note   Macro IS_IRDA_INSTANCE(p_usart) can be used to check whether or not
  *         IrDA feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableIrda(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->CR3, USART_CR3_IREN);
}

/**
  * @brief  Disable IrDA mode.
  * @rmtoll
  *  CR3          IREN          LL_USART_DisableIrda
  * @param  p_usart USART Instance
  * @note   Macro IS_IRDA_INSTANCE(p_usart) can be used to check whether or not
  *         IrDA feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableIrda(USART_TypeDef *p_usart)
{
  STM32_CLEAR_BIT(p_usart->CR3, USART_CR3_IREN);
}

/**
  * @brief  Indicate if IrDA mode is enabled.
  * @rmtoll
  *  CR3          IREN          LL_USART_IsEnabledIrda
  * @param  p_usart USART Instance
  * @note   Macro IS_IRDA_INSTANCE(p_usart) can be used to check whether or not
  *         IrDA feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledIrda(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR3, USART_CR3_IREN) == (USART_CR3_IREN)) ? 1UL : 0UL);
}

/**
  * @brief  Configure IrDA Power Mode (Normal or Low Power).
  * @rmtoll
  *  CR3          IRLP          LL_USART_SetIrdaPowerMode
  * @param  p_usart USART Instance
  * @param  power_mode This parameter can be one of the following values:
  *         @arg @ref LL_USART_IRDA_POWER_MODE_NORMAL
  *         @arg @ref LL_USART_IRDA_POWER_MODE_LOW
  * @note   Macro IS_IRDA_INSTANCE(p_usart) can be used to check whether or not
  *         IrDA feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_SetIrdaPowerMode(USART_TypeDef *p_usart, uint32_t power_mode)
{
  STM32_MODIFY_REG(p_usart->CR3, USART_CR3_IRLP, power_mode);
}

/**
  * @brief  Retrieve IrDA Power Mode configuration (Normal or Low Power).
  * @rmtoll
  *  CR3          IRLP          LL_USART_GetIrdaPowerMode
  * @param  p_usart USART Instance
  * @note   Macro IS_IRDA_INSTANCE(p_usart) can be used to check whether or not
  *         IrDA feature is supported by the p_usart instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_IRDA_POWER_MODE_NORMAL
  *         @arg @ref LL_USART_IRDA_POWER_MODE_LOW
  */
__STATIC_INLINE uint32_t LL_USART_GetIrdaPowerMode(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR3, USART_CR3_IRLP));
}

/**
  * @brief  Set Irda prescaler value, used for dividing the USART clock source
  *         to achieve the Irda Low Power frequency (8 bits value).
  * @rmtoll
  *  GTPR         PSC           LL_USART_SetIrdaPrescaler
  * @param  p_usart USART Instance
  * @param  prescaler_value Value between Min_Data=0x00 and Max_Data=0xFF
  * @note   Macro IS_IRDA_INSTANCE(p_usart) can be used to check whether or not
  *         IrDA feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_SetIrdaPrescaler(USART_TypeDef *p_usart, uint32_t prescaler_value)
{
  STM32_MODIFY_REG(p_usart->GTPR, USART_GTPR_PSC, (uint16_t)prescaler_value);
}

/**
  * @brief  Return Irda prescaler value, used for dividing the USART clock source
  *         to achieve the Irda Low Power frequency (8 bits value).
  * @rmtoll
  *  GTPR         PSC           LL_USART_GetIrdaPrescaler
  * @param  p_usart USART Instance
  * @note   Macro IS_IRDA_INSTANCE(p_usart) can be used to check whether or not
  *         IrDA feature is supported by the p_usart instance.
  * @retval Irda prescaler value (Value between Min_Data=0x00 and Max_Data=0xFF)
  */
__STATIC_INLINE uint32_t LL_USART_GetIrdaPrescaler(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->GTPR, USART_GTPR_PSC));
}

/**
  * @}
  */

/** @defgroup USART_LL_EF_Configuration_Smartcard Configuration functions related to Smartcard feature
  * @{
  */

/**
  * @brief  Enable Smartcard NACK transmission.
  * @rmtoll
  *  CR3          NACK          LL_USART_EnableSmartcardNACK
  * @param  p_usart USART Instance
  * @note   Macro IS_SMARTCARD_INSTANCE(p_usart) can be used to check whether or not
  *         Smartcard feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableSmartcardNACK(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->CR3, USART_CR3_NACK);
}

/**
  * @brief  Disable Smartcard NACK transmission.
  * @rmtoll
  *  CR3          NACK          LL_USART_DisableSmartcardNACK
  * @param  p_usart USART Instance
  * @note   Macro IS_SMARTCARD_INSTANCE(p_usart) can be used to check whether or not
  *         Smartcard feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableSmartcardNACK(USART_TypeDef *p_usart)
{
  STM32_CLEAR_BIT(p_usart->CR3, USART_CR3_NACK);
}

/**
  * @brief  Indicate if Smartcard NACK transmission is enabled.
  * @rmtoll
  *  CR3          NACK          LL_USART_IsEnabledSmartcardNACK
  * @param  p_usart USART Instance
  * @note   Macro IS_SMARTCARD_INSTANCE(p_usart) can be used to check whether or not
  *         Smartcard feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledSmartcardNACK(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR3, USART_CR3_NACK) == (USART_CR3_NACK)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Smartcard mode.
  * @rmtoll
  *  CR3          SCEN          LL_USART_EnableSmartcard
  * @param  p_usart USART Instance
  * @note   Macro IS_SMARTCARD_INSTANCE(p_usart) can be used to check whether or not
  *         Smartcard feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableSmartcard(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->CR3, USART_CR3_SCEN);
}

/**
  * @brief  Disable Smartcard mode.
  * @rmtoll
  *  CR3          SCEN          LL_USART_DisableSmartcard
  * @param  p_usart USART Instance
  * @note   Macro IS_SMARTCARD_INSTANCE(p_usart) can be used to check whether or not
  *         Smartcard feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableSmartcard(USART_TypeDef *p_usart)
{
  STM32_CLEAR_BIT(p_usart->CR3, USART_CR3_SCEN);
}

/**
  * @brief  Indicate if Smartcard mode is enabled.
  * @rmtoll
  *  CR3          SCEN          LL_USART_IsEnabledSmartcard
  * @param  p_usart USART Instance
  * @note   Macro IS_SMARTCARD_INSTANCE(p_usart) can be used to check whether or not
  *         Smartcard feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledSmartcard(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR3, USART_CR3_SCEN) == (USART_CR3_SCEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set Smartcard Auto-Retry Count value (SCARCNT[2:0] bits).
  * @rmtoll
  *  CR3          SCARCNT       LL_USART_SetSmartcardAutoRetryCount
  * @param  p_usart USART Instance
  * @param  auto_retry_count Value between Min_Data=0 and Max_Data=7
  * @note   Macro IS_SMARTCARD_INSTANCE(p_usart) can be used to check whether or not
  *         Smartcard feature is supported by the p_usart instance.
  * @note   This bit-field specifies the number of retries in transmit and receive, in Smartcard mode.
  *         In transmission mode, it specifies the number of automatic retransmission retries, before
  *         generating a transmission error (FE bit set).
  *         In reception mode, it specifies the number or erroneous reception trials, before generating a
  *         reception error (RXNE and PE bits set)
  */
__STATIC_INLINE void LL_USART_SetSmartcardAutoRetryCount(USART_TypeDef *p_usart, uint32_t auto_retry_count)
{
  STM32_MODIFY_REG(p_usart->CR3, USART_CR3_SCARCNT, auto_retry_count << USART_CR3_SCARCNT_Pos);
}

/**
  * @brief  Return Smartcard Auto-Retry Count value (SCARCNT[2:0] bits).
  * @rmtoll
  *  CR3          SCARCNT       LL_USART_GetSmartcardAutoRetryCount
  * @param  p_usart USART Instance
  * @note   Macro IS_SMARTCARD_INSTANCE(p_usart) can be used to check whether or not
  *         Smartcard feature is supported by the p_usart instance.
  * @retval Smartcard Auto-Retry Count value (Value between Min_Data=0 and Max_Data=7)
  */
__STATIC_INLINE uint32_t LL_USART_GetSmartcardAutoRetryCount(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR3, USART_CR3_SCARCNT) >> USART_CR3_SCARCNT_Pos);
}

/**
  * @brief  Set Smartcard prescaler value, used for dividing the USART clock
  *         source to provide the SMARTCARD Clock (5 bits value).
  * @rmtoll
  *  GTPR         PSC           LL_USART_SetSmartcardPrescaler
  * @param  p_usart USART Instance
  * @param  prescaler_value Value between Min_Data=0 and Max_Data=31
  * @note   Macro IS_SMARTCARD_INSTANCE(p_usart) can be used to check whether or not
  *         Smartcard feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_SetSmartcardPrescaler(USART_TypeDef *p_usart, uint32_t prescaler_value)
{
  STM32_MODIFY_REG(p_usart->GTPR, USART_GTPR_PSC, (uint16_t)prescaler_value);
}

/**
  * @brief  Return Smartcard prescaler value, used for dividing the USART clock
  *         source to provide the SMARTCARD Clock (5 bits value).
  * @rmtoll
  *  GTPR         PSC           LL_USART_GetSmartcardPrescaler
  * @param  p_usart USART Instance
  * @note   Macro IS_SMARTCARD_INSTANCE(p_usart) can be used to check whether or not
  *         Smartcard feature is supported by the p_usart instance.
  * @retval Smartcard prescaler value (Value between Min_Data=0 and Max_Data=31)
  */
__STATIC_INLINE uint32_t LL_USART_GetSmartcardPrescaler(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->GTPR, USART_GTPR_PSC));
}

/**
  * @brief  Set Smartcard Guard time value, expressed in nb of baud clocks periods
  *         (GT[7:0] bits : Guard time value).
  * @rmtoll
  *  GTPR         GT            LL_USART_SetSmartcardGuardTime
  * @param  p_usart USART Instance
  * @param  guard_time Value between Min_Data=0x00 and Max_Data=0xFF
  * @note   Macro IS_SMARTCARD_INSTANCE(p_usart) can be used to check whether or not
  *         Smartcard feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_SetSmartcardGuardTime(USART_TypeDef *p_usart, uint32_t guard_time)
{
  STM32_MODIFY_REG(p_usart->GTPR, USART_GTPR_GT, (uint16_t)(guard_time << USART_GTPR_GT_Pos));
}

/**
  * @brief  Return Smartcard Guard time value, expressed in nb of baud clocks periods
  *         (GT[7:0] bits : Guard time value).
  * @rmtoll
  *  GTPR         GT            LL_USART_GetSmartcardGuardTime
  * @param  p_usart USART Instance
  * @note   Macro IS_SMARTCARD_INSTANCE(p_usart) can be used to check whether or not
  *         Smartcard feature is supported by the p_usart instance.
  * @retval Smartcard Guard time value (Value between Min_Data=0x00 and Max_Data=0xFF)
  */
__STATIC_INLINE uint32_t LL_USART_GetSmartcardGuardTime(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->GTPR, USART_GTPR_GT) >> USART_GTPR_GT_Pos);
}

/**
  * @}
  */

/** @defgroup USART_LL_EF_Configuration_HalfDuplex Configuration functions related to Half Duplex feature
  * @{
  */

/**
  * @brief  Enable Single Wire Half-Duplex mode.
  * @rmtoll
  *  CR3          HDSEL         LL_USART_EnableHalfDuplex
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_HALFDUPLEX_INSTANCE(p_usart) can be used to check whether or not
  *         Half-Duplex mode is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableHalfDuplex(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->CR3, USART_CR3_HDSEL);
}

/**
  * @brief  Disable Single Wire Half-Duplex mode.
  * @rmtoll
  *  CR3          HDSEL         LL_USART_DisableHalfDuplex
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_HALFDUPLEX_INSTANCE(p_usart) can be used to check whether or not
  *         Half-Duplex mode is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableHalfDuplex(USART_TypeDef *p_usart)
{
  STM32_CLEAR_BIT(p_usart->CR3, USART_CR3_HDSEL);
}

/**
  * @brief  Indicate if Single Wire Half-Duplex mode is enabled.
  * @rmtoll
  *  CR3          HDSEL         LL_USART_IsEnabledHalfDuplex
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_HALFDUPLEX_INSTANCE(p_usart) can be used to check whether or not
  *         Half-Duplex mode is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledHalfDuplex(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR3, USART_CR3_HDSEL) == (USART_CR3_HDSEL)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup USART_LL_EF_Configuration_SPI_SLAVE Configuration functions related to SPI Slave feature
  * @{
  */
/**
  * @brief  Enable SPI Synchronous Slave mode.
  * @rmtoll
  *  CR2          SLVEN         LL_USART_EnableSPISlave
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_SPI_SLAVE_INSTANCE(p_usart) can be used to check whether or not
  *         SPI Slave mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableSPISlave(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->CR2, USART_CR2_SLVEN);
}

/**
  * @brief  Disable SPI Synchronous Slave mode.
  * @rmtoll
  *  CR2          SLVEN         LL_USART_DisableSPISlave
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_SPI_SLAVE_INSTANCE(p_usart) can be used to check whether or not
  *         SPI Slave mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableSPISlave(USART_TypeDef *p_usart)
{
  STM32_CLEAR_BIT(p_usart->CR2, USART_CR2_SLVEN);
}

/**
  * @brief  Indicate if  SPI Synchronous Slave mode is enabled.
  * @rmtoll
  *  CR2          SLVEN         LL_USART_IsEnabledSPISlave
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_SPI_SLAVE_INSTANCE(p_usart) can be used to check whether or not
  *         SPI Slave mode feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledSPISlave(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR2, USART_CR2_SLVEN) == (USART_CR2_SLVEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable SPI Slave Selection using NSS input pin.
  * @rmtoll
  *  CR2          DIS_NSS       LL_USART_EnableSPISlaveSelect
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_SPI_SLAVE_INSTANCE(p_usart) can be used to check whether or not
  *         SPI Slave mode feature is supported by the p_usart instance.
  * @note   SPI Slave Selection depends on NSS input pin
  *         (The slave is selected when NSS is low and deselected when NSS is high).
  */
__STATIC_INLINE void LL_USART_EnableSPISlaveSelect(USART_TypeDef *p_usart)
{
  STM32_CLEAR_BIT(p_usart->CR2, USART_CR2_DIS_NSS);
}

/**
  * @brief  Disable SPI Slave Selection using NSS input pin.
  * @rmtoll
  *  CR2          DIS_NSS       LL_USART_DisableSPISlaveSelect
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_SPI_SLAVE_INSTANCE(p_usart) can be used to check whether or not
  *         SPI Slave mode feature is supported by the p_usart instance.
  * @note   SPI Slave will be always selected and NSS input pin will be ignored.
  */
__STATIC_INLINE void LL_USART_DisableSPISlaveSelect(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->CR2, USART_CR2_DIS_NSS);
}

/**
  * @brief  Indicate if  SPI Slave Selection depends on NSS input pin.
  * @rmtoll
  *  CR2          DIS_NSS       LL_USART_IsEnabledSPISlaveSelect
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_SPI_SLAVE_INSTANCE(p_usart) can be used to check whether or not
  *         SPI Slave mode feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledSPISlaveSelect(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR2, USART_CR2_DIS_NSS) != (USART_CR2_DIS_NSS)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup USART_LL_EF_Configuration_LIN Configuration functions related to LIN feature
  * @{
  */

/**
  * @brief  Set LIN Break Detection Length.
  * @rmtoll
  *  CR2          LBDL          LL_USART_SetLINBrkDetectionLen
  * @param  p_usart USART Instance
  * @param  lin_break_detect_length This parameter can be one of the following values:
  *         @arg @ref LL_USART_LIN_BREAK_DETECT_10_BIT
  *         @arg @ref LL_USART_LIN_BREAK_DETECT_11_BIT
  * @note   Macro IS_UART_LIN_INSTANCE(p_usart) can be used to check whether or not
  *         LIN feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_SetLINBrkDetectionLen(USART_TypeDef *p_usart, uint32_t lin_break_detect_length)
{
  STM32_MODIFY_REG(p_usart->CR2, USART_CR2_LBDL, lin_break_detect_length);
}

/**
  * @brief  Return LIN Break Detection Length.
  * @rmtoll
  *  CR2          LBDL          LL_USART_GetLINBrkDetectionLen
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_LIN_INSTANCE(p_usart) can be used to check whether or not
  *         LIN feature is supported by the p_usart instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_LIN_BREAK_DETECT_10_BIT
  *         @arg @ref LL_USART_LIN_BREAK_DETECT_11_BIT
  */
__STATIC_INLINE uint32_t LL_USART_GetLINBrkDetectionLen(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR2, USART_CR2_LBDL));
}

/**
  * @brief  Enable LIN mode.
  * @rmtoll
  *  CR2          LINEN         LL_USART_EnableLIN
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_LIN_INSTANCE(p_usart) can be used to check whether or not
  *         LIN feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableLIN(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->CR2, USART_CR2_LINEN);
}

/**
  * @brief  Disable LIN mode.
  * @rmtoll
  *  CR2          LINEN         LL_USART_DisableLIN
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_LIN_INSTANCE(p_usart) can be used to check whether or not
  *         LIN feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableLIN(USART_TypeDef *p_usart)
{
  STM32_CLEAR_BIT(p_usart->CR2, USART_CR2_LINEN);
}

/**
  * @brief  Indicate if LIN mode is enabled.
  * @rmtoll
  *  CR2          LINEN         LL_USART_IsEnabledLIN
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_LIN_INSTANCE(p_usart) can be used to check whether or not
  *         LIN feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledLIN(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR2, USART_CR2_LINEN) == (USART_CR2_LINEN)) ? 1UL : 0UL);
}

/**
  * @}
  */

