MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_usart.h
/** @defgroup USART_LL_EF_Configuration_DE Configuration functions related to Driver Enable feature
  * @{
  */

/**
  * @brief  Set DEDT (Driver Enable De-Assertion Time), Time value expressed on 5 bits ([4:0] bits).
  * @rmtoll
  *  CR1          DEDT          LL_USART_SetDEDeassertionTime
  * @param  p_usart USART Instance
  * @param  time Value between Min_Data=0 and Max_Data=31
  * @note   Macro IS_UART_DRIVER_ENABLE_INSTANCE(p_usart) can be used to check whether or not
  *         Driver Enable feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_SetDEDeassertionTime(USART_TypeDef *p_usart, uint32_t time)
{
  STM32_MODIFY_REG(p_usart->CR1, USART_CR1_DEDT, time << USART_CR1_DEDT_Pos);
}

/**
  * @brief  Return DEDT (Driver Enable De-Assertion Time).
  * @rmtoll
  *  CR1          DEDT          LL_USART_GetDEDeassertionTime
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_DRIVER_ENABLE_INSTANCE(p_usart) can be used to check whether or not
  *         Driver Enable feature is supported by the p_usart instance.
  * @retval Time value expressed on 5 bits ([4:0] bits) : Value between Min_Data=0 and Max_Data=31
  */
__STATIC_INLINE uint32_t LL_USART_GetDEDeassertionTime(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR1, USART_CR1_DEDT) >> USART_CR1_DEDT_Pos);
}

/**
  * @brief  Set DEAT (Driver Enable Assertion Time), Time value expressed on 5 bits ([4:0] bits).
  * @rmtoll
  *  CR1          DEAT          LL_USART_SetDEAssertionTime
  * @param  p_usart USART Instance
  * @param  time Value between Min_Data=0 and Max_Data=31
  * @note   Macro IS_UART_DRIVER_ENABLE_INSTANCE(p_usart) can be used to check whether or not
  *         Driver Enable feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_SetDEAssertionTime(USART_TypeDef *p_usart, uint32_t time)
{
  STM32_MODIFY_REG(p_usart->CR1, USART_CR1_DEAT, time << USART_CR1_DEAT_Pos);
}

/**
  * @brief  Return DEAT (Driver Enable Assertion Time).
  * @rmtoll
  *  CR1          DEAT          LL_USART_GetDEAssertionTime
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_DRIVER_ENABLE_INSTANCE(p_usart) can be used to check whether or not
  *         Driver Enable feature is supported by the p_usart instance.
  * @retval Time value expressed on 5 bits ([4:0] bits) : Value between Min_Data=0 and Max_Data=31
  */
__STATIC_INLINE uint32_t LL_USART_GetDEAssertionTime(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR1, USART_CR1_DEAT) >> USART_CR1_DEAT_Pos);
}

/**
  * @brief  Set DEAT (Driver Enable Assertion Time) and DEDT (Driver Enable De-Assertion Time),
  *         time values expressed on 5 bits ([4:0] bits).
  * @rmtoll
  *  CR1          DEAT          LL_USART_SetDEAssertionTime \n
  *  CR1          DEDT          LL_USART_GetDEDeassertionTime
  * @param  p_usart USART Instance
  * @param  assertion_time Value between Min_Data=0 and Max_Data=31
  * @param  deassertion_time Value between Min_Data=0 and Max_Data=31
  * @note   Macro IS_UART_DRIVER_ENABLE_INSTANCE(p_usart) can be used to check whether or not
  *         Driver Enable feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_ConfigDETime(USART_TypeDef *p_usart, uint32_t assertion_time, uint32_t deassertion_time)
{
  STM32_MODIFY_REG(p_usart->CR1, USART_CR1_DEAT | USART_CR1_DEDT,
                   (assertion_time << USART_CR1_DEAT_Pos) | (deassertion_time << USART_CR1_DEDT_Pos));
}

/**
  * @brief  Enable Driver Enable (DE) Mode.
  * @rmtoll
  *  CR3          DEM           LL_USART_EnableDEMode
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_DRIVER_ENABLE_INSTANCE(p_usart) can be used to check whether or not
  *         Driver Enable feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableDEMode(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->CR3, USART_CR3_DEM);
}

/**
  * @brief  Disable Driver Enable (DE) Mode.
  * @rmtoll
  *  CR3          DEM           LL_USART_DisableDEMode
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_DRIVER_ENABLE_INSTANCE(p_usart) can be used to check whether or not
  *         Driver Enable feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableDEMode(USART_TypeDef *p_usart)
{
  STM32_CLEAR_BIT(p_usart->CR3, USART_CR3_DEM);
}

/**
  * @brief  Indicate if Driver Enable (DE) Mode is enabled.
  * @rmtoll
  *  CR3          DEM           LL_USART_IsEnabledDEMode
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_DRIVER_ENABLE_INSTANCE(p_usart) can be used to check whether or not
  *         Driver Enable feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledDEMode(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR3, USART_CR3_DEM) == (USART_CR3_DEM)) ? 1UL : 0UL);
}

/**
  * @brief  Select Driver Enable Polarity.
  * @rmtoll
  *  CR3          DEP           LL_USART_SetDESignalPolarity
  * @param  p_usart USART Instance
  * @param  polarity This parameter can be one of the following values:
  *         @arg @ref LL_USART_DE_POLARITY_HIGH
  *         @arg @ref LL_USART_DE_POLARITY_LOW
  * @note   Macro IS_UART_DRIVER_ENABLE_INSTANCE(p_usart) can be used to check whether or not
  *         Driver Enable feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_SetDESignalPolarity(USART_TypeDef *p_usart, uint32_t polarity)
{
  STM32_MODIFY_REG(p_usart->CR3, USART_CR3_DEP, polarity);
}

/**
  * @brief  Return Driver Enable Polarity.
  * @rmtoll
  *  CR3          DEP           LL_USART_GetDESignalPolarity
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_DRIVER_ENABLE_INSTANCE(p_usart) can be used to check whether or not
  *         Driver Enable feature is supported by the p_usart instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_USART_DE_POLARITY_HIGH
  *         @arg @ref LL_USART_DE_POLARITY_LOW
  */
__STATIC_INLINE uint32_t LL_USART_GetDESignalPolarity(const USART_TypeDef *p_usart)
{
  return (uint32_t)(STM32_READ_BIT(p_usart->CR3, USART_CR3_DEP));
}

/**
  * @}
  */

