MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_usart.h
/** @defgroup USART_LL_EF_AdvancedConfiguration Advanced Configurations services
  * @{
  */

/**
  * @brief  Perform basic configuration of USART for enabling use in Asynchronous Mode (UART).
  * @rmtoll
  *  CR2          LINEN         LL_USART_ConfigAsyncMode \n
  *  CR2          CLKEN         LL_USART_ConfigAsyncMode \n
  *  CR3          SCEN          LL_USART_ConfigAsyncMode \n
  *  CR3          IREN          LL_USART_ConfigAsyncMode \n
  *  CR3          HDSEL         LL_USART_ConfigAsyncMode
  * @param  p_usart USART Instance
  * @note   In UART mode, the following bits must be kept cleared:
  *           - LINEN bit in the USART_CR2 register,
  *           - CLKEN bit in the USART_CR2 register,
  *           - SCEN bit in the USART_CR3 register,
  *           - IREN bit in the USART_CR3 register,
  *           - HDSEL bit in the USART_CR3 register.
  * @note   Call of this function is equivalent to following function call sequence :
  *         - Clear LINEN in CR2 using @ref LL_USART_DisableLIN() function
  *         - Clear CLKEN in CR2 using @ref LL_USART_DisableSCLKOutput() function
  *         - Clear SCEN in CR3 using @ref LL_USART_DisableSmartcard() function
  *         - Clear IREN in CR3 using @ref LL_USART_DisableIrda() function
  *         - Clear HDSEL in CR3 using @ref LL_USART_DisableHalfDuplex() function
  * @note   Other remaining configurations items related to Asynchronous Mode
  *         (as Baud Rate, Word length, Parity, ...) must be set using
  *         dedicated functions
  */
__STATIC_INLINE void LL_USART_ConfigAsyncMode(USART_TypeDef *p_usart)
{
  /* In Asynchronous mode, the following bits must be kept cleared:
  - LINEN, CLKEN bits in the USART_CR2 register,
  - SCEN, IREN and HDSEL bits in the USART_CR3 register.
  */
  STM32_CLEAR_BIT(p_usart->CR2, (USART_CR2_LINEN | USART_CR2_CLKEN));
  STM32_CLEAR_BIT(p_usart->CR3, (USART_CR3_SCEN | USART_CR3_IREN | USART_CR3_HDSEL));
}


/**
  * @brief  Perform basic configuration of USART for enabling use in Synchronous Mode.
  * @rmtoll
  *  CR2          LINEN         LL_USART_ConfigSyncMasterMode \n
  *  CR2          CLKEN         LL_USART_ConfigSyncMasterMode \n
  *  CR3          SCEN          LL_USART_ConfigSyncMasterMode \n
  *  CR3          IREN          LL_USART_ConfigSyncMasterMode \n
  *  CR3          HDSEL         LL_USART_ConfigSyncMasterMode
  * @param  p_usart USART Instance
  * @note   In Synchronous mode, the following bits must be kept cleared:
  *           - LINEN bit in the USART_CR2 register,
  *           - SCEN bit in the USART_CR3 register,
  *           - IREN bit in the USART_CR3 register,
  *           - HDSEL bit in the USART_CR3 register.
  *         This function also sets the USART in Synchronous mode.
  * @note   Macro IS_USART_INSTANCE(p_usart) can be used to check whether or not
  *         Synchronous mode is supported by the p_usart instance.
  * @note   Call of this function is equivalent to following function call sequence :
  *         - Clear LINEN in CR2 using @ref LL_USART_DisableLIN() function
  *         - Clear IREN in CR3 using @ref LL_USART_DisableIrda() function
  *         - Clear SCEN in CR3 using @ref LL_USART_DisableSmartcard() function
  *         - Clear HDSEL in CR3 using @ref LL_USART_DisableHalfDuplex() function
  *         - Set CLKEN in CR2 using @ref LL_USART_EnableSCLKOutput() function
  * @note   Other remaining configurations items related to Synchronous Mode
  *         (as Baud Rate, Word length, Parity, Clock Polarity, ...) must be set using
  *         dedicated functions
  */
__STATIC_INLINE void LL_USART_ConfigSyncMasterMode(USART_TypeDef *p_usart)
{
  /* In Synchronous mode, the following bits must be kept cleared:
  - LINEN bit in the USART_CR2 register,
  - SCEN, IREN and HDSEL bits in the USART_CR3 register.
  */
  STM32_CLEAR_BIT(p_usart->CR2, (USART_CR2_LINEN | USART_CR2_SLVEN));
  STM32_CLEAR_BIT(p_usart->CR3, (USART_CR3_SCEN | USART_CR3_IREN | USART_CR3_HDSEL));
  /* set the UART/USART in Synchronous mode */
  STM32_SET_BIT(p_usart->CR2, USART_CR2_CLKEN);
}

/**
  * @brief  Perform basic configuration of USART for enabling use in Synchronous Slave Mode.
  * @rmtoll
  *  CR2          LINEN         LL_USART_ConfigSyncMasterMode \n
  *  CR2          CLKEN         LL_USART_ConfigSyncMasterMode \n
  *  CR3          SCEN          LL_USART_ConfigSyncMasterMode \n
  *  CR3          IREN          LL_USART_ConfigSyncMasterMode \n
  *  CR3          HDSEL         LL_USART_ConfigSyncMasterMode
  * @param  p_usart USART Instance
  * @note   In Synchronous mode, the following bits must be kept cleared:
  *           - LINEN bit in the USART_CR2 register,
  *           - SCEN bit in the USART_CR3 register,
  *           - IREN bit in the USART_CR3 register,
  *           - HDSEL bit in the USART_CR3 register.
  *         This function also sets the USART in Synchronous mode.
  * @note   Macro IS_USART_INSTANCE(p_usart) can be used to check whether or not
  *         Synchronous mode is supported by the p_usart instance.
  * @note   Call of this function is equivalent to following function call sequence :
  *         - Clear LINEN in CR2 using @ref LL_USART_DisableLIN() function
  *         - Clear IREN in CR3 using @ref LL_USART_DisableIrda() function
  *         - Clear SCEN in CR3 using @ref LL_USART_DisableSmartcard() function
  *         - Clear HDSEL in CR3 using @ref LL_USART_DisableHalfDuplex() function
  *         - Set CLKEN in CR2 using @ref LL_USART_EnableSCLKOutput() function
  * @note   Other remaining configurations items related to Synchronous Mode
  *         (as Baud Rate, Word length, Parity, Clock Polarity, ...) must be set using
  *         dedicated functions
  */
__STATIC_INLINE void LL_USART_ConfigSyncSlaveMode(USART_TypeDef *p_usart)
{
  /* In Synchronous mode, the following bits must be kept cleared:
  - LINEN bit in the USART_CR2 register,
  - SCEN, IREN and HDSEL bits in the USART_CR3 register.
  */
  STM32_CLEAR_BIT(p_usart->CR2, (USART_CR2_LINEN | USART_CR2_CLKEN));
  STM32_CLEAR_BIT(p_usart->CR3, (USART_CR3_SCEN | USART_CR3_IREN | USART_CR3_HDSEL));
  /* set the UART/USART in Synchronous mode */
  STM32_SET_BIT(p_usart->CR2, USART_CR2_SLVEN);
}

/**
  * @brief  Perform basic configuration of USART for enabling use in LIN Mode.
  * @rmtoll
  *  CR2          CLKEN         LL_USART_ConfigLINMode \n
  *  CR2          STOP          LL_USART_ConfigLINMode \n
  *  CR2          LINEN         LL_USART_ConfigLINMode \n
  *  CR3          IREN          LL_USART_ConfigLINMode \n
  *  CR3          SCEN          LL_USART_ConfigLINMode \n
  *  CR3          HDSEL         LL_USART_ConfigLINMode
  * @param  p_usart USART Instance
  * @note   In LIN mode, the following bits must be kept cleared:
  *           - STOP and CLKEN bits in the USART_CR2 register,
  *           - SCEN bit in the USART_CR3 register,
  *           - IREN bit in the USART_CR3 register,
  *           - HDSEL bit in the USART_CR3 register.
  *         This function also set the UART/USART in LIN mode.
  * @note   Macro IS_UART_LIN_INSTANCE(p_usart) can be used to check whether or not
  *         LIN feature is supported by the p_usart instance.
  * @note   Call of this function is equivalent to following function call sequence :
  *         - Clear CLKEN in CR2 using @ref LL_USART_DisableSCLKOutput() function
  *         - Clear STOP in CR2 using @ref LL_USART_SetStopBitsLength() function
  *         - Clear SCEN in CR3 using @ref LL_USART_DisableSmartcard() function
  *         - Clear IREN in CR3 using @ref LL_USART_DisableIrda() function
  *         - Clear HDSEL in CR3 using @ref LL_USART_DisableHalfDuplex() function
  *         - Set LINEN in CR2 using @ref LL_USART_EnableLIN() function
  * @note   Other remaining configurations items related to LIN Mode
  *         (as Baud Rate, Word length, LIN Break Detection Length, ...) must be set using
  *         dedicated functions
  */
__STATIC_INLINE void LL_USART_ConfigLINMode(USART_TypeDef *p_usart)
{
  /* In LIN mode, the following bits must be kept cleared:
  - STOP and CLKEN bits in the USART_CR2 register,
  - IREN, SCEN and HDSEL bits in the USART_CR3 register.
  */
  STM32_CLEAR_BIT(p_usart->CR2, (USART_CR2_CLKEN | USART_CR2_STOP));
  STM32_CLEAR_BIT(p_usart->CR3, (USART_CR3_IREN | USART_CR3_SCEN | USART_CR3_HDSEL));
  /* Set the UART/USART in LIN mode */
  STM32_SET_BIT(p_usart->CR2, USART_CR2_LINEN);
}

/**
  * @brief  Perform basic configuration of USART for enabling use in Half Duplex Mode.
  * @rmtoll
  *  CR2          LINEN         LL_USART_ConfigHalfDuplexMode \n
  *  CR2          CLKEN         LL_USART_ConfigHalfDuplexMode \n
  *  CR3          HDSEL         LL_USART_ConfigHalfDuplexMode \n
  *  CR3          SCEN          LL_USART_ConfigHalfDuplexMode \n
  *  CR3          IREN          LL_USART_ConfigHalfDuplexMode
  * @param  p_usart USART Instance
  * @note   In Half Duplex mode, the following bits must be kept cleared:
  *           - LINEN bit in the USART_CR2 register,
  *           - CLKEN bit in the USART_CR2 register,
  *           - SCEN bit in the USART_CR3 register,
  *           - IREN bit in the USART_CR3 register,
  *         This function also sets the UART/USART in Half Duplex mode.
  * @note   Macro IS_UART_HALFDUPLEX_INSTANCE(p_usart) can be used to check whether or not
  *         Half-Duplex mode is supported by the p_usart instance.
  * @note   Call of this function is equivalent to following function call sequence :
  *         - Clear LINEN in CR2 using @ref LL_USART_DisableLIN() function
  *         - Clear CLKEN in CR2 using @ref LL_USART_DisableSCLKOutput() function
  *         - Clear SCEN in CR3 using @ref LL_USART_DisableSmartcard() function
  *         - Clear IREN in CR3 using @ref LL_USART_DisableIrda() function
  *         - Set HDSEL in CR3 using @ref LL_USART_EnableHalfDuplex() function
  * @note   Other remaining configurations items related to Half Duplex Mode
  *         (as Baud Rate, Word length, Parity, ...) must be set using
  *         dedicated functions
  */
__STATIC_INLINE void LL_USART_ConfigHalfDuplexMode(USART_TypeDef *p_usart)
{
  /* In Half Duplex mode, the following bits must be kept cleared:
  - LINEN and CLKEN bits in the USART_CR2 register,
  - SCEN and IREN bits in the USART_CR3 register.
  */
  STM32_CLEAR_BIT(p_usart->CR2, (USART_CR2_LINEN | USART_CR2_CLKEN));
  STM32_CLEAR_BIT(p_usart->CR3, (USART_CR3_SCEN | USART_CR3_IREN));
  /* set the UART/USART in Half Duplex mode */
  STM32_SET_BIT(p_usart->CR3, USART_CR3_HDSEL);
}

/**
  * @brief  Perform basic configuration of USART for enabling use in Smartcard Mode.
  * @rmtoll
  *  CR2          LINEN         LL_USART_ConfigSmartcardMode \n
  *  CR2          STOP          LL_USART_ConfigSmartcardMode \n
  *  CR2          CLKEN         LL_USART_ConfigSmartcardMode \n
  *  CR3          HDSEL         LL_USART_ConfigSmartcardMode \n
  *  CR3          SCEN          LL_USART_ConfigSmartcardMode
  * @param  p_usart USART Instance
  * @note   In Smartcard mode, the following bits must be kept cleared:
  *           - LINEN bit in the USART_CR2 register,
  *           - IREN bit in the USART_CR3 register,
  *           - HDSEL bit in the USART_CR3 register.
  *         This function also configures Stop bits to 1.5 bits and
  *         sets the USART in Smartcard mode (SCEN bit).
  *         Clock Output is also enabled (CLKEN).
  * @note   Macro IS_SMARTCARD_INSTANCE(p_usart) can be used to check whether or not
  *         Smartcard feature is supported by the p_usart instance.
  * @note   Call of this function is equivalent to following function call sequence :
  *         - Clear LINEN in CR2 using @ref LL_USART_DisableLIN() function
  *         - Clear IREN in CR3 using @ref LL_USART_DisableIrda() function
  *         - Clear HDSEL in CR3 using @ref LL_USART_DisableHalfDuplex() function
  *         - Configure STOP in CR2 using @ref LL_USART_SetStopBitsLength() function
  *         - Set CLKEN in CR2 using @ref LL_USART_EnableSCLKOutput() function
  *         - Set SCEN in CR3 using @ref LL_USART_EnableSmartcard() function
  * @note   Other remaining configurations items related to Smartcard Mode
  *         (as Baud Rate, Word length, Parity, ...) must be set using
  *         dedicated functions
  */
__STATIC_INLINE void LL_USART_ConfigSmartcardMode(USART_TypeDef *p_usart)
{
  /* In Smartcard mode, the following bits must be kept cleared:
  - LINEN bit in the USART_CR2 register,
  - IREN and HDSEL bits in the USART_CR3 register.
  */
  STM32_CLEAR_BIT(p_usart->CR2, (USART_CR2_LINEN));
  STM32_CLEAR_BIT(p_usart->CR3, (USART_CR3_IREN | USART_CR3_HDSEL));
  /* Configure Stop bits to 1.5 bits */
  /* Synchronous mode is activated by default */
  STM32_SET_BIT(p_usart->CR2, (USART_CR2_STOP_0 | USART_CR2_STOP_1 | USART_CR2_CLKEN));
  /* set the UART/USART in Smartcard mode */
  STM32_SET_BIT(p_usart->CR3, USART_CR3_SCEN);
}

/**
  * @brief  Perform basic configuration of USART for enabling use in Irda Mode.
  * @rmtoll
  *  CR2          LINEN         LL_USART_ConfigIrdaMode \n
  *  CR2          CLKEN         LL_USART_ConfigIrdaMode \n
  *  CR2          STOP          LL_USART_ConfigIrdaMode \n
  *  CR3          SCEN          LL_USART_ConfigIrdaMode \n
  *  CR3          HDSEL         LL_USART_ConfigIrdaMode \n
  *  CR3          IREN          LL_USART_ConfigIrdaMode
  * @param  p_usart USART Instance
  * @note   In IRDA mode, the following bits must be kept cleared:
  *           - LINEN bit in the USART_CR2 register,
  *           - STOP and CLKEN bits in the USART_CR2 register,
  *           - SCEN bit in the USART_CR3 register,
  *           - HDSEL bit in the USART_CR3 register.
  *         This function also sets the UART/USART in IRDA mode (IREN bit).
  * @note   Macro IS_IRDA_INSTANCE(p_usart) can be used to check whether or not
  *         IrDA feature is supported by the p_usart instance.
  * @note   Call of this function is equivalent to following function call sequence :
  *         - Clear LINEN in CR2 using @ref LL_USART_DisableLIN() function
  *         - Clear CLKEN in CR2 using @ref LL_USART_DisableSCLKOutput() function
  *         - Clear SCEN in CR3 using @ref LL_USART_DisableSmartcard() function
  *         - Clear HDSEL in CR3 using @ref LL_USART_DisableHalfDuplex() function
  *         - Configure STOP in CR2 using @ref LL_USART_SetStopBitsLength() function
  *         - Set IREN in CR3 using @ref LL_USART_EnableIrda() function
  * @note   Other remaining configurations items related to Irda Mode
  *         (as Baud Rate, Word length, Power mode, ...) must be set using
  *         dedicated functions
  */
__STATIC_INLINE void LL_USART_ConfigIrdaMode(USART_TypeDef *p_usart)
{
  /* In IRDA mode, the following bits must be kept cleared:
  - LINEN, STOP and CLKEN bits in the USART_CR2 register,
  - SCEN and HDSEL bits in the USART_CR3 register.
  */
  STM32_CLEAR_BIT(p_usart->CR2, (USART_CR2_LINEN | USART_CR2_CLKEN | USART_CR2_STOP));
  STM32_CLEAR_BIT(p_usart->CR3, (USART_CR3_SCEN | USART_CR3_HDSEL));
  /* set the UART/USART in IRDA mode */
  STM32_SET_BIT(p_usart->CR3, USART_CR3_IREN);
}

/**
  * @brief  Perform basic configuration of USART for enabling use in Multi processor Mode
  *         (several USARTs connected in a network, one of the USARTs can be the master,
  *         its TX output connected to the RX inputs of the other slaves USARTs).
  * @rmtoll
  *  CR2          LINEN         LL_USART_ConfigMultiProcessMode \n
  *  CR2          CLKEN         LL_USART_ConfigMultiProcessMode \n
  *  CR3          SCEN          LL_USART_ConfigMultiProcessMode \n
  *  CR3          HDSEL         LL_USART_ConfigMultiProcessMode \n
  *  CR3          IREN          LL_USART_ConfigMultiProcessMode
  * @param  p_usart USART Instance
  * @note   In MultiProcessor mode, the following bits must be kept cleared:
  *           - LINEN bit in the USART_CR2 register,
  *           - CLKEN bit in the USART_CR2 register,
  *           - SCEN bit in the USART_CR3 register,
  *           - IREN bit in the USART_CR3 register,
  *           - HDSEL bit in the USART_CR3 register.
  * @note   Call of this function is equivalent to following function call sequence :
  *         - Clear LINEN in CR2 using @ref LL_USART_DisableLIN() function
  *         - Clear CLKEN in CR2 using @ref LL_USART_DisableSCLKOutput() function
  *         - Clear SCEN in CR3 using @ref LL_USART_DisableSmartcard() function
  *         - Clear IREN in CR3 using @ref LL_USART_DisableIrda() function
  *         - Clear HDSEL in CR3 using @ref LL_USART_DisableHalfDuplex() function
  * @note   Other remaining configurations items related to Multi processor Mode
  *         (as Baud Rate, Wake Up Method, Node address, ...) must be set using
  *         dedicated functions
  */
__STATIC_INLINE void LL_USART_ConfigMultiProcessMode(USART_TypeDef *p_usart)
{
  /* In Multi Processor mode, the following bits must be kept cleared:
  - LINEN and CLKEN bits in the USART_CR2 register,
  - IREN, SCEN and HDSEL bits in the USART_CR3 register.
  */
  STM32_CLEAR_BIT(p_usart->CR2, (USART_CR2_LINEN | USART_CR2_CLKEN));
  STM32_CLEAR_BIT(p_usart->CR3, (USART_CR3_SCEN | USART_CR3_HDSEL | USART_CR3_IREN));
}

/**
  * @}
  */

/** @defgroup USART_LL_EF_FLAG_Management FLAG_Management
  * @{
  */

/**
  * @brief  Check if the USART Flag Mask is set or not.
  * @rmtoll
  *  ISR          PE            LL_USART_IsActiveFlag \n
  *  ISR          FE            LL_USART_IsActiveFlag \n
  *  ISR          NE            LL_USART_IsActiveFlag \n
  *  ISR          ORE           LL_USART_IsActiveFlag \n
  *  ISR          IDLE          LL_USART_IsActiveFlag \n
  *  ISR          RXNE_RXFNE    LL_USART_IsActiveFlag \n
  *  ISR          TC            LL_USART_IsActiveFlag \n
  *  ISR          TXE_TXFNF     LL_USART_IsActiveFlag \n
  *  ISR          LBDF          LL_USART_IsActiveFlag \n
  *  ISR          CTSIF         LL_USART_IsActiveFlag \n
  *  ISR          CTS           LL_USART_IsActiveFlag \n
  *  ISR          RTOF          LL_USART_IsActiveFlag \n
  *  ISR          EOBF          LL_USART_IsActiveFlag \n
  *  ISR          UDR           LL_USART_IsActiveFlag \n
  *  ISR          ABRE          LL_USART_IsActiveFlag \n
  *  ISR          ABRF          LL_USART_IsActiveFlag \n
  *  ISR          BUSY          LL_USART_IsActiveFlag \n
  *  ISR          CMF           LL_USART_IsActiveFlag \n
  *  ISR          SBKF          LL_USART_IsActiveFlag \n
  *  ISR          RWU           LL_USART_IsActiveFlag \n
  *  ISR          WUF           LL_USART_IsActiveFlag \n
  *  ISR          TEACK         LL_USART_IsActiveFlag \n
  *  ISR          REACK         LL_USART_IsActiveFlag \n
  *  ISR          TXFE          LL_USART_IsActiveFlag \n
  *  ISR          RXFF          LL_USART_IsActiveFlag \n
  *  ISR          TCBGT         LL_USART_IsActiveFlag \n
  *  ISR          TXFT          LL_USART_IsActiveFlag \n
  *  ISR          RXFT          LL_USART_IsActiveFlag
  * @param  p_usart USART Instance
  * @param  mask Mask to tests
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag(const USART_TypeDef *p_usart, uint32_t mask)
{
  return ((STM32_READ_BIT(p_usart->ISR, mask) == (mask)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART Parity Error Flag is set or not.
  * @rmtoll
  *  ISR          PE            LL_USART_IsActiveFlag_PE
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_PE(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_PE) == (USART_ISR_PE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART Framing Error Flag is set or not.
  * @rmtoll
  *  ISR          FE            LL_USART_IsActiveFlag_FE
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_FE(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_FE) == (USART_ISR_FE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART Noise error detected Flag is set or not.
  * @rmtoll
  *  ISR          NE            LL_USART_IsActiveFlag_NE
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_NE(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_NE) == (USART_ISR_NE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART OverRun Error Flag is set or not.
  * @rmtoll
  *  ISR          ORE           LL_USART_IsActiveFlag_ORE
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_ORE(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_ORE) == (USART_ISR_ORE)) ? 1UL : 0UL);
}

/**
  * @brief  Check whether the USART IDLE line detected flag is set.
  * @rmtoll
  *  ISR          IDLE          LL_USART_IsActiveFlag_IDLE
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_IDLE(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_IDLE) == (USART_ISR_IDLE)) ? 1UL : 0UL);
}


/**
  * @brief  Check whether the USART Read Data Register or USART RX FIFO Not Empty Flag is set.
  * @rmtoll
  *  ISR          RXNE_RXFNE    LL_USART_IsActiveFlag_RXNE_RXFNE
  * @param  p_usart USART Instance
  * @note   Use macro IS_UART_FIFO_INSTANCE(p_usart) to check whether
  *         the FIFO mode feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_RXNE_RXFNE(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_RXNE_RXFNE) == (USART_ISR_RXNE_RXFNE)) ? 1UL : 0UL);
}

/**
  * @brief  Check whether the USART Transmission Complete Flag is set.
  * @rmtoll
  *  ISR          TC            LL_USART_IsActiveFlag_TC
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_TC(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_TC) == (USART_ISR_TC)) ? 1UL : 0UL);
}


/**
  * @brief  Check whether the USART Transmit Data Register Empty or USART TX FIFO Not Full Flag is set.
  * @rmtoll
  *  ISR          TXE_TXFNF     LL_USART_IsActiveFlag_TXE_TXFNF
  * @param  p_usart USART Instance
  * @note   Use macro IS_UART_FIFO_INSTANCE(p_usart) to check whether
  *         the FIFO mode feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_TXE_TXFNF(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_TXE_TXFNF) == (USART_ISR_TXE_TXFNF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART LIN Break Detection Flag is set or not.
  * @rmtoll
  *  ISR          LBDF          LL_USART_IsActiveFlag_LBD
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_LIN_INSTANCE(p_usart) can be used to check whether or not
  *         LIN feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_LBD(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_LBDF) == (USART_ISR_LBDF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART CTS interrupt Flag is set or not.
  * @rmtoll
  *  ISR          CTSIF         LL_USART_IsActiveFlag_nCTS
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_HWFLOW_INSTANCE(p_usart) can be used to check whether or not
  *         Hardware Flow control feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_nCTS(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_CTSIF) == (USART_ISR_CTSIF)) ? 1UL : 0UL);
}

