MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_usart.h
/**
  * @brief  Check if the USART CTS Flag is set or not.
  * @rmtoll
  *  ISR          CTS           LL_USART_IsActiveFlag_CTS
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_HWFLOW_INSTANCE(p_usart) can be used to check whether or not
  *         Hardware Flow control feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_CTS(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_CTS) == (USART_ISR_CTS)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART Receiver Time Out Flag is set or not.
  * @rmtoll
  *  ISR          RTOF          LL_USART_IsActiveFlag_RTO
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_RTO(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_RTOF) == (USART_ISR_RTOF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART End Of Block Flag is set or not.
  * @rmtoll
  *  ISR          EOBF          LL_USART_IsActiveFlag_EOB
  * @param  p_usart USART Instance
  * @note   Macro IS_SMARTCARD_INSTANCE(p_usart) can be used to check whether or not
  *         Smartcard feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_EOB(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_EOBF) == (USART_ISR_EOBF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the SPI Slave Underrun error flag is set or not.
  * @rmtoll
  *  ISR          UDR           LL_USART_IsActiveFlag_UDR
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_SPI_SLAVE_INSTANCE(p_usart) can be used to check whether or not
  *         SPI Slave mode feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_UDR(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_UDR) == (USART_ISR_UDR)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART Auto-Baud Rate Error Flag is set or not.
  * @rmtoll
  *  ISR          ABRE          LL_USART_IsActiveFlag_ABRE
  * @param  p_usart USART Instance
  * @note   Macro IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(p_usart) can be used to check whether or not
  *         Auto Baud Rate detection feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_ABRE(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_ABRE) == (USART_ISR_ABRE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART Auto-Baud Rate Flag is set or not.
  * @rmtoll
  *  ISR          ABRF          LL_USART_IsActiveFlag_ABR
  * @param  p_usart USART Instance
  * @note   Macro IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(p_usart) can be used to check whether or not
  *         Auto Baud Rate detection feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_ABR(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_ABRF) == (USART_ISR_ABRF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART Busy Flag is set or not.
  * @rmtoll
  *  ISR          BUSY          LL_USART_IsActiveFlag_BUSY
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_BUSY(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_BUSY) == (USART_ISR_BUSY)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART Character Match Flag is set or not.
  * @rmtoll
  *  ISR          CMF           LL_USART_IsActiveFlag_CM
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_CM(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_CMF) == (USART_ISR_CMF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART Send Break Flag is set or not.
  * @rmtoll
  *  ISR          SBKF          LL_USART_IsActiveFlag_SBK
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_SBK(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_SBKF) == (USART_ISR_SBKF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART Receive Wake Up from mute mode Flag is set or not.
  * @rmtoll
  *  ISR          RWU           LL_USART_IsActiveFlag_RWU
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_RWU(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_RWU) == (USART_ISR_RWU)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART Wake Up from stop mode Flag is set or not.
  * @rmtoll
  *  ISR          WUF           LL_USART_IsActiveFlag_WKUP
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_WAKEUP_FROMSTOP_INSTANCE(p_usart) can be used to check whether or not
  *         Wake-up from Stop mode feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_WKUP(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_WUF) == (USART_ISR_WUF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART Transmit Enable Acknowledge Flag is set or not.
  * @rmtoll
  *  ISR          TEACK         LL_USART_IsActiveFlag_TEACK
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_TEACK(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_TEACK) == (USART_ISR_TEACK)) ? 1UL : 0UL);
}

/**
  * @brief  Check whether the USART Receive Enable Acknowledge Flag is set.
  * @rmtoll
  *  ISR          REACK         LL_USART_IsActiveFlag_REACK
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_REACK(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_REACK) == (USART_ISR_REACK)) ? 1UL : 0UL);
}

/**
  * @brief  Check whether the USART TX FIFO Empty Flag is set.
  * @rmtoll
  *  ISR          TXFE          LL_USART_IsActiveFlag_TXFE
  * @param  p_usart USART Instance
  * @note   Use macro IS_UART_FIFO_INSTANCE(p_usart) to check whether
  *         the FIFO mode feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_TXFE(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_TXFE) == (USART_ISR_TXFE)) ? 1UL : 0UL);
}

/**
  * @brief  Check whether the USART RX FIFO Full Flag is set.
  * @rmtoll
  *  ISR          RXFF          LL_USART_IsActiveFlag_RXFF
  * @param  p_usart USART Instance
  * @note   Use macro IS_UART_FIFO_INSTANCE(p_usart) to check whether
  *         the FIFO mode feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_RXFF(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_RXFF) == (USART_ISR_RXFF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the Smartcard Transmission Complete Before Guard Time Flag is set or not.
  * @rmtoll
  *  ISR          TCBGT         LL_USART_IsActiveFlag_TCBGT
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_TCBGT(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_TCBGT) == (USART_ISR_TCBGT)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART TX FIFO Threshold Flag is set or not.
  * @rmtoll
  *  ISR          TXFT          LL_USART_IsActiveFlag_TXFT
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_TXFT(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_TXFT) == (USART_ISR_TXFT)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART RX FIFO Threshold Flag is set or not.
  * @rmtoll
  *  ISR          RXFT          LL_USART_IsActiveFlag_RXFT
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsActiveFlag_RXFT(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->ISR, USART_ISR_RXFT) == (USART_ISR_RXFT)) ? 1UL : 0UL);
}


/**
  * @brief  Clear the Flag Mask.
  * @rmtoll
  *  ISR          PE            LL_USART_ClearFlag \n
  *  ISR          FE            LL_USART_ClearFlag \n
  *  ISR          NE            LL_USART_ClearFlag \n
  *  ISR          ORE           LL_USART_ClearFlag \n
  *  ISR          IDLE          LL_USART_ClearFlag \n
  *  ISR          TC            LL_USART_ClearFlag \n
  *  ISR          LBDF          LL_USART_ClearFlag \n
  *  ISR          CTS           LL_USART_ClearFlag \n
  *  ISR          RTOF          LL_USART_ClearFlag \n
  *  ISR          EOBF          LL_USART_ClearFlag \n
  *  ISR          UDR           LL_USART_ClearFlag \n
  *  ISR          CMF           LL_USART_ClearFlag \n
  *  ISR          WUF           LL_USART_ClearFlag \n
  *  ISR          TXFE          LL_USART_ClearFlag \n
  *  ISR          TCBGT         LL_USART_ClearFlag
  * @param  p_usart USART Instance
  * @param  mask Mask to tests
  */
__STATIC_INLINE void LL_USART_ClearFlag(USART_TypeDef *p_usart, uint32_t mask)
{
  STM32_WRITE_REG(p_usart->ICR, mask);
}

/**
  * @brief  Clear Parity Error Flag.
  * @rmtoll
  *  ICR          PECF          LL_USART_ClearFlag_PE
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_ClearFlag_PE(USART_TypeDef *p_usart)
{
  STM32_WRITE_REG(p_usart->ICR, USART_ICR_PECF);
}

/**
  * @brief  Clear Framing Error Flag.
  * @rmtoll
  *  ICR          FECF          LL_USART_ClearFlag_FE
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_ClearFlag_FE(USART_TypeDef *p_usart)
{
  STM32_WRITE_REG(p_usart->ICR, USART_ICR_FECF);
}

/**
  * @brief  Clear Noise Error detected Flag.
  * @rmtoll
  *  ICR          NECF           LL_USART_ClearFlag_NE
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_ClearFlag_NE(USART_TypeDef *p_usart)
{
  STM32_WRITE_REG(p_usart->ICR, USART_ICR_NECF);
}

/**
  * @brief  Clear OverRun Error Flag.
  * @rmtoll
  *  ICR          ORECF         LL_USART_ClearFlag_ORE
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_ClearFlag_ORE(USART_TypeDef *p_usart)
{
  STM32_WRITE_REG(p_usart->ICR, USART_ICR_ORECF);
}

/**
  * @brief  Clear IDLE line detected Flag.
  * @rmtoll
  *  ICR          IDLECF        LL_USART_ClearFlag_IDLE
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_ClearFlag_IDLE(USART_TypeDef *p_usart)
{
  STM32_WRITE_REG(p_usart->ICR, USART_ICR_IDLECF);
}

/**
  * @brief  Clear TX FIFO Empty Flag.
  * @rmtoll
  *  ICR          TXFECF        LL_USART_ClearFlag_TXFE
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_ClearFlag_TXFE(USART_TypeDef *p_usart)
{
  STM32_WRITE_REG(p_usart->ICR, USART_ICR_TXFECF);
}

/**
  * @brief  Clear Transmission Complete Flag.
  * @rmtoll
  *  ICR          TCCF          LL_USART_ClearFlag_TC
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_ClearFlag_TC(USART_TypeDef *p_usart)
{
  STM32_WRITE_REG(p_usart->ICR, USART_ICR_TCCF);
}

/**
  * @brief  Clear Smartcard Transmission Complete Before Guard Time Flag.
  * @rmtoll
  *  ICR          TCBGTCF       LL_USART_ClearFlag_TCBGT
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_ClearFlag_TCBGT(USART_TypeDef *p_usart)
{
  STM32_WRITE_REG(p_usart->ICR, USART_ICR_TCBGTCF);
}

/**
  * @brief  Clear LIN Break Detection Flag.
  * @rmtoll
  *  ICR          LBDCF         LL_USART_ClearFlag_LBD
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_LIN_INSTANCE(p_usart) can be used to check whether or not
  *         LIN feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_ClearFlag_LBD(USART_TypeDef *p_usart)
{
  STM32_WRITE_REG(p_usart->ICR, USART_ICR_LBDCF);
}

/**
  * @brief  Clear CTS Interrupt Flag.
  * @rmtoll
  *  ICR          CTSCF         LL_USART_ClearFlag_nCTS
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_HWFLOW_INSTANCE(p_usart) can be used to check whether or not
  *         Hardware Flow control feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_ClearFlag_nCTS(USART_TypeDef *p_usart)
{
  STM32_WRITE_REG(p_usart->ICR, USART_ICR_CTSCF);
}

/**
  * @brief  Clear Receiver Time Out Flag.
  * @rmtoll
  *  ICR          RTOCF         LL_USART_ClearFlag_RTO
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_ClearFlag_RTO(USART_TypeDef *p_usart)
{
  STM32_WRITE_REG(p_usart->ICR, USART_ICR_RTOCF);
}

/**
  * @brief  Clear End Of Block Flag.
  * @rmtoll
  *  ICR          EOBCF         LL_USART_ClearFlag_EOB
  * @param  p_usart USART Instance
  * @note   Macro IS_SMARTCARD_INSTANCE(p_usart) can be used to check whether or not
  *         Smartcard feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_ClearFlag_EOB(USART_TypeDef *p_usart)
{
  STM32_WRITE_REG(p_usart->ICR, USART_ICR_EOBCF);
}

/**
  * @brief  Clear SPI Slave Underrun Flag.
  * @rmtoll
  *  ICR          UDRCF         LL_USART_ClearFlag_UDR
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_SPI_SLAVE_INSTANCE(p_usart) can be used to check whether or not
  *         SPI Slave mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_ClearFlag_UDR(USART_TypeDef *p_usart)
{
  STM32_WRITE_REG(p_usart->ICR, USART_ICR_UDRCF);
}

/**
  * @brief  Clear Character Match Flag.
  * @rmtoll
  *  ICR          CMCF          LL_USART_ClearFlag_CM
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_ClearFlag_CM(USART_TypeDef *p_usart)
{
  STM32_WRITE_REG(p_usart->ICR, USART_ICR_CMCF);
}

/**
  * @brief  Clear Wake Up from stop mode Flag.
  * @rmtoll
  *  ICR          WUCF          LL_USART_ClearFlag_WKUP
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_WAKEUP_FROMSTOP_INSTANCE(p_usart) can be used to check whether or not
  *         Wake-up from Stop mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_ClearFlag_WKUP(USART_TypeDef *p_usart)
{
  STM32_WRITE_REG(p_usart->ICR, USART_ICR_WUCF);
}

/**
  * @}
  */

/** @defgroup USART_LL_EF_IT_Management IT_Management
  * @{
  */

/**
  * @brief  Enable CR1 Interrupt.
  * @rmtoll
  *  CR1          IDLEIE         LL_USART_EnableIT_CR1 \n
  *  CR1          RXNEIE_RXFNEIE LL_USART_EnableIT_CR1 \n
  *  CR1          TCIE           LL_USART_EnableIT_CR1 \n
  *  CR1          TXEIE_TXFNFIE  LL_USART_EnableIT_CR1 \n
  *  CR1          PEIE           LL_USART_EnableIT_CR1 \n
  *  CR1          CMIE           LL_USART_EnableIT_CR1 \n
  *  CR1          RTOIE          LL_USART_EnableIT_CR1 \n
  *  CR1          EOBIE          LL_USART_EnableIT_CR1 \n
  *  CR1          TXFEIE         LL_USART_EnableIT_CR1 \n
  *  CR1          RXFFIE         LL_USART_EnableIT_CR1
  * @param  p_usart USART Instance
  * @param  mask   mask to enable
  */
__STATIC_INLINE void LL_USART_EnableIT_CR1(USART_TypeDef *p_usart, uint32_t mask)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR1, mask);
}
/**
  * @brief  Enable IDLE Interrupt.
  * @rmtoll
  *  CR1          IDLEIE        LL_USART_EnableIT_IDLE
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_EnableIT_IDLE(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR1, USART_CR1_IDLEIE);
}


/**
  * @brief  Enable RX Not Empty and RX FIFO Not Empty Interrupt.
  * @rmtoll
  *  CR1        RXNEIE_RXFNEIE  LL_USART_EnableIT_RXNE_RXFNE
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableIT_RXNE_RXFNE(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR1, USART_CR1_RXNEIE_RXFNEIE);
}

/**
  * @brief  Enable Transmission Complete Interrupt.
  * @rmtoll
  *  CR1          TCIE          LL_USART_EnableIT_TC
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_EnableIT_TC(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR1, USART_CR1_TCIE);
}


/**
  * @brief  Enable TX Empty and TX FIFO Not Full Interrupt.
  * @rmtoll
  *  CR1         TXEIE_TXFNFIE  LL_USART_EnableIT_TXE_TXFNF
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableIT_TXE_TXFNF(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR1, USART_CR1_TXEIE_TXFNFIE);
}

/**
  * @brief  Enable Parity Error Interrupt.
  * @rmtoll
  *  CR1          PEIE          LL_USART_EnableIT_PE
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_EnableIT_PE(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR1, USART_CR1_PEIE);
}

/**
  * @brief  Enable Character Match Interrupt.
  * @rmtoll
  *  CR1          CMIE          LL_USART_EnableIT_CM
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_EnableIT_CM(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR1, USART_CR1_CMIE);
}

/**
  * @brief  Enable Receiver Timeout Interrupt.
  * @rmtoll
  *  CR1          RTOIE         LL_USART_EnableIT_RTO
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_EnableIT_RTO(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR1, USART_CR1_RTOIE);
}

/**
  * @brief  Enable End Of Block Interrupt.
  * @rmtoll
  *  CR1          EOBIE         LL_USART_EnableIT_EOB
  * @param  p_usart USART Instance
  * @note   Macro IS_SMARTCARD_INSTANCE(p_usart) can be used to check whether or not
  *         Smartcard feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableIT_EOB(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR1, USART_CR1_EOBIE);
}

/**
  * @brief  Enable TX FIFO Empty Interrupt.
  * @rmtoll
  *  CR1          TXFEIE        LL_USART_EnableIT_TXFE
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableIT_TXFE(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR1, USART_CR1_TXFEIE);
}

/**
  * @brief  Enable RX FIFO Full Interrupt.
  * @rmtoll
  *  CR1          RXFFIE        LL_USART_EnableIT_RXFF
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_EnableIT_RXFF(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR1, USART_CR1_RXFFIE);
}

/**
  * @brief  Enable CR2 Interrupt.
  * @rmtoll
  *  CR2          LBDIE         LL_USART_EnableIT_CR2
  * @param  p_usart USART Instance
  * @param  mask   mask to enable
  */
__STATIC_INLINE void LL_USART_EnableIT_CR2(USART_TypeDef *p_usart, uint32_t mask)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR2, mask);
}

/**
  * @brief  Enable LIN Break Detection Interrupt.
  * @rmtoll
  *  CR2          LBDIE         LL_USART_EnableIT_LBD
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_LIN_INSTANCE(p_usart) can be used to check whether or not
  *         LIN feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableIT_LBD(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->CR2, USART_CR2_LBDIE);
}

/**
  * @brief  Enable CR3 Interrupt.
  * @rmtoll
  *  CR3          EIE            LL_USART_EnableIT_CR3 \n
  *  CR3          CTSIE          LL_USART_EnableIT_CR3 \n
  *  CR3          WUFIE          LL_USART_EnableIT_CR3 \n
  *  CR3          TXFTIE         LL_USART_EnableIT_CR3 \n
  *  CR3          TCBGTIE        LL_USART_EnableIT_CR3 \n
  *  CR3          RXFTIE         LL_USART_EnableIT_CR3
  * @param  p_usart USART Instance
  * @param  mask   mask to enable
  */
__STATIC_INLINE void LL_USART_EnableIT_CR3(USART_TypeDef *p_usart, uint32_t mask)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR3, mask);
}

/**
  * @brief  Enable Error Interrupt.
  * @rmtoll
  *  CR3          EIE           LL_USART_EnableIT_ERROR
  * @param  p_usart USART Instance
  * @note   When set, Error Interrupt Enable Bit is enabling interrupt generation in case of a framing
  *         error, overrun error or noise flag (FE=1 or ORE=1 or NF=1 in the p_usart ISR register).
  *           0: Interrupt is inhibited
  *           1: An interrupt is generated when FE=1 or ORE=1 or NF=1 in the p_usart ISR register.
  */
__STATIC_INLINE void LL_USART_EnableIT_ERROR(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR3, USART_CR3_EIE);
}

/**
  * @brief  Enable CTS Interrupt.
  * @rmtoll
  *  CR3          CTSIE         LL_USART_EnableIT_CTS
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_HWFLOW_INSTANCE(p_usart) can be used to check whether or not
  *         Hardware Flow control feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableIT_CTS(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR3, USART_CR3_CTSIE);
}

/**
  * @brief  Enable Wake Up from Stop Mode Interrupt.
  * @rmtoll
  *  CR3          WUFIE         LL_USART_EnableIT_WKUP
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_WAKEUP_FROMSTOP_INSTANCE(p_usart) can be used to check whether or not
  *         Wake-up from Stop mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableIT_WKUP(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR3, USART_CR3_WUFIE);
}

/**
  * @brief  Enable TX FIFO Threshold Interrupt.
  * @rmtoll
  *  CR3          TXFTIE        LL_USART_EnableIT_TXFT
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableIT_TXFT(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR3, USART_CR3_TXFTIE);
}

/**
  * @brief  Enable Smartcard Transmission Complete Before Guard Time Interrupt.
  * @rmtoll
  *  CR3          TCBGTIE       LL_USART_EnableIT_TCBGT
  * @param  p_usart USART Instance
  * @note   Macro IS_SMARTCARD_INSTANCE(p_usart) can be used to check whether or not
  *         Smartcard feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableIT_TCBGT(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR3, USART_CR3_TCBGTIE);
}

/**
  * @brief  Enable RX FIFO Threshold Interrupt.
  * @rmtoll
  *  CR3          RXFTIE        LL_USART_EnableIT_RXFT
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_EnableIT_RXFT(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR3, USART_CR3_RXFTIE);
}

