MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_usart.h
/**
  * @brief  Disable CR1 Interrupt.
  * @rmtoll
  *  CR1          IDLEIE         LL_USART_DisableIT_CR1 \n
  *  CR1          RXNEIE_RXFNEIE LL_USART_DisableIT_CR1 \n
  *  CR1          TCIE           LL_USART_DisableIT_CR1 \n
  *  CR1          TXEIE_TXFNFIE  LL_USART_DisableIT_CR1 \n
  *  CR1          PEIE           LL_USART_DisableIT_CR1 \n
  *  CR1          CMIE           LL_USART_DisableIT_CR1 \n
  *  CR1          RTOIE          LL_USART_DisableIT_CR1 \n
  *  CR1          EOBIE          LL_USART_DisableIT_CR1 \n
  *  CR1          TXFEIE         LL_USART_DisableIT_CR1 \n
  *  CR1          RXFFIE         LL_USART_DisableIT_CR1
  * @param  p_usart USART Instance
  * @param  mask   mask to disable
  */
__STATIC_INLINE void LL_USART_DisableIT_CR1(USART_TypeDef *p_usart, uint32_t mask)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR1, mask);
}

/**
  * @brief  Disable IDLE Interrupt.
  * @rmtoll
  *  CR1          IDLEIE        LL_USART_DisableIT_IDLE
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_DisableIT_IDLE(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR1, USART_CR1_IDLEIE);
}


/**
  * @brief  Disable RX Not Empty and RX FIFO Not Empty Interrupt.
  * @rmtoll
  *  CR1        RXNEIE_RXFNEIE  LL_USART_DisableIT_RXNE_RXFNE
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableIT_RXNE_RXFNE(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR1, USART_CR1_RXNEIE_RXFNEIE);
}

/**
  * @brief  Disable Transmission Complete Interrupt.
  * @rmtoll
  *  CR1          TCIE          LL_USART_DisableIT_TC
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_DisableIT_TC(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR1, USART_CR1_TCIE);
}


/**
  * @brief  Disable TX Empty and TX FIFO Not Full Interrupt.
  * @rmtoll
  *  CR1        TXEIE_TXFNFIE  LL_USART_DisableIT_TXE_TXFNF
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableIT_TXE_TXFNF(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR1, USART_CR1_TXEIE_TXFNFIE);
}

/**
  * @brief  Disable Parity Error Interrupt.
  * @rmtoll
  *  CR1          PEIE          LL_USART_DisableIT_PE
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_DisableIT_PE(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR1, USART_CR1_PEIE);
}

/**
  * @brief  Disable Character Match Interrupt.
  * @rmtoll
  *  CR1          CMIE          LL_USART_DisableIT_CM
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_DisableIT_CM(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR1, USART_CR1_CMIE);
}

/**
  * @brief  Disable Receiver Timeout Interrupt.
  * @rmtoll
  *  CR1          RTOIE         LL_USART_DisableIT_RTO
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_DisableIT_RTO(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR1, USART_CR1_RTOIE);
}

/**
  * @brief  Disable End Of Block Interrupt.
  * @rmtoll
  *  CR1          EOBIE         LL_USART_DisableIT_EOB
  * @param  p_usart USART Instance
  * @note   Macro IS_SMARTCARD_INSTANCE(p_usart) can be used to check whether or not
  *         Smartcard feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableIT_EOB(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR1, USART_CR1_EOBIE);
}

/**
  * @brief  Disable TX FIFO Empty Interrupt.
  * @rmtoll
  *  CR1          TXFEIE        LL_USART_DisableIT_TXFE
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableIT_TXFE(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR1, USART_CR1_TXFEIE);
}

/**
  * @brief  Disable RX FIFO Full Interrupt.
  * @rmtoll
  *  CR1          RXFFIE        LL_USART_DisableIT_RXFF
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableIT_RXFF(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR1, USART_CR1_RXFFIE);
}


/**
  * @brief  Disable CR2 Interrupt.
  * @rmtoll
  *  CR2          LBDIE         LL_USART_DisableIT_CR2
  * @param  p_usart USART Instance
  * @param  mask   mask to disable
  */
__STATIC_INLINE void LL_USART_DisableIT_CR2(USART_TypeDef *p_usart, uint32_t mask)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR2, mask);
}

/**
  * @brief  Disable LIN Break Detection Interrupt.
  * @rmtoll
  *  CR2          LBDIE         LL_USART_DisableIT_LBD
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_LIN_INSTANCE(p_usart) can be used to check whether or not
  *         LIN feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableIT_LBD(USART_TypeDef *p_usart)
{
  STM32_CLEAR_BIT(p_usart->CR2, USART_CR2_LBDIE);
}

/**
  * @brief  Disable CR3 Interrupt.
  * @rmtoll
  *  CR3          EIE            LL_USART_DisableIT_CR3 \n
  *  CR3          CTSIE          LL_USART_DisableIT_CR3 \n
  *  CR3          WUFIE          LL_USART_DisableIT_CR3 \n
  *  CR3          TXFTIE         LL_USART_DisableIT_CR3 \n
  *  CR3          TCBGTIE        LL_USART_DisableIT_CR3 \n
  *  CR3          RXFTIE         LL_USART_DisableIT_CR3
  * @param  p_usart USART Instance
  * @param  mask   mask to disable
  */
__STATIC_INLINE void LL_USART_DisableIT_CR3(USART_TypeDef *p_usart, uint32_t mask)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR3, mask);
}

/**
  * @brief  Disable Error Interrupt.
  * @rmtoll
  *  CR3          EIE           LL_USART_DisableIT_ERROR
  * @param  p_usart USART Instance
  * @note   When set, Error Interrupt Enable Bit is enabling interrupt generation in case of a framing
  *         error, overrun error or noise flag (FE=1 or ORE=1 or NF=1 in the p_usart ISR register).
  *           0: Interrupt is inhibited
  *           1: An interrupt is generated when FE=1 or ORE=1 or NF=1 in the p_usart ISR register.
  */
__STATIC_INLINE void LL_USART_DisableIT_ERROR(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR3, USART_CR3_EIE);
}

/**
  * @brief  Disable CTS Interrupt.
  * @rmtoll
  *  CR3          CTSIE         LL_USART_DisableIT_CTS
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_HWFLOW_INSTANCE(p_usart) can be used to check whether or not
  *         Hardware Flow control feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableIT_CTS(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR3, USART_CR3_CTSIE);
}

/**
  * @brief  Disable Wake Up from Stop Mode Interrupt.
  * @rmtoll
  *  CR3          WUFIE         LL_USART_DisableIT_WKUP
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_WAKEUP_FROMSTOP_INSTANCE(p_usart) can be used to check whether or not
  *         Wake-up from Stop mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableIT_WKUP(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR3, USART_CR3_WUFIE);
}

/**
  * @brief  Disable TX FIFO Threshold Interrupt.
  * @rmtoll
  *  CR3          TXFTIE        LL_USART_DisableIT_TXFT
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableIT_TXFT(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR3, USART_CR3_TXFTIE);
}

/**
  * @brief  Disable Smartcard Transmission Complete Before Guard Time Interrupt.
  * @rmtoll
  *  CR3          TCBGTIE       LL_USART_DisableIT_TCBGT
  * @param  p_usart USART Instance
  * @note   Macro IS_SMARTCARD_INSTANCE(p_usart) can be used to check whether or not
  *         Smartcard feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableIT_TCBGT(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR3, USART_CR3_TCBGTIE);
}

/**
  * @brief  Disable RX FIFO Threshold Interrupt.
  * @rmtoll
  *  CR3          RXFTIE        LL_USART_DisableIT_RXFT
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_DisableIT_RXFT(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR3, USART_CR3_RXFTIE);
}

/**
  * @brief  Check if the USART IDLE Interrupt  source is enabled or disabled.
  * @rmtoll
  *  CR1          IDLEIE        LL_USART_IsEnabledIT_IDLE
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledIT_IDLE(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR1, USART_CR1_IDLEIE) == (USART_CR1_IDLEIE)) ? 1UL : 0UL);
}


/**
  * @brief  Check if the USART RX Not Empty and USART RX FIFO Not Empty Interrupt is enabled or disabled.
  * @rmtoll
  *  CR1        RXNEIE_RXFNEIE  LL_USART_IsEnabledIT_RXNE_RXFNE
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledIT_RXNE_RXFNE(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR1, USART_CR1_RXNEIE_RXFNEIE) == (USART_CR1_RXNEIE_RXFNEIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART Transmission Complete Interrupt is enabled or disabled.
  * @rmtoll
  *  CR1          TCIE          LL_USART_IsEnabledIT_TC
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledIT_TC(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR1, USART_CR1_TCIE) == (USART_CR1_TCIE)) ? 1UL : 0UL);
}


/**
  * @brief  Check if the USART TX Empty and USART TX FIFO Not Full Interrupt is enabled or disabled.
  * @rmtoll
  *  CR1         TXEIE_TXFNFIE  LL_USART_IsEnabledIT_TXE_TXFNF
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledIT_TXE_TXFNF(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR1, USART_CR1_TXEIE_TXFNFIE) == (USART_CR1_TXEIE_TXFNFIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART Parity Error Interrupt is enabled or disabled.
  * @rmtoll
  *  CR1          PEIE          LL_USART_IsEnabledIT_PE
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledIT_PE(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR1, USART_CR1_PEIE) == (USART_CR1_PEIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART Character Match Interrupt is enabled or disabled.
  * @rmtoll
  *  CR1          CMIE          LL_USART_IsEnabledIT_CM
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledIT_CM(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR1, USART_CR1_CMIE) == (USART_CR1_CMIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART Receiver Timeout Interrupt is enabled or disabled.
  * @rmtoll
  *  CR1          RTOIE         LL_USART_IsEnabledIT_RTO
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledIT_RTO(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR1, USART_CR1_RTOIE) == (USART_CR1_RTOIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART End Of Block Interrupt is enabled or disabled.
  * @rmtoll
  *  CR1          EOBIE         LL_USART_IsEnabledIT_EOB
  * @param  p_usart USART Instance
  * @note   Macro IS_SMARTCARD_INSTANCE(p_usart) can be used to check whether or not
  *         Smartcard feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledIT_EOB(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR1, USART_CR1_EOBIE) == (USART_CR1_EOBIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART TX FIFO Empty Interrupt is enabled or disabled.
  * @rmtoll
  *  CR1          TXFEIE        LL_USART_IsEnabledIT_TXFE
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledIT_TXFE(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR1, USART_CR1_TXFEIE) == (USART_CR1_TXFEIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART RX FIFO Full Interrupt is enabled or disabled.
  * @rmtoll
  *  CR1          RXFFIE        LL_USART_IsEnabledIT_RXFF
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledIT_RXFF(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR1, USART_CR1_RXFFIE) == (USART_CR1_RXFFIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART LIN Break Detection Interrupt is enabled or disabled.
  * @rmtoll
  *  CR2          LBDIE         LL_USART_IsEnabledIT_LBD
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_LIN_INSTANCE(p_usart) can be used to check whether or not
  *         LIN feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledIT_LBD(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR2, USART_CR2_LBDIE) == (USART_CR2_LBDIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART Error Interrupt is enabled or disabled.
  * @rmtoll
  *  CR3          EIE           LL_USART_IsEnabledIT_ERROR
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledIT_ERROR(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR3, USART_CR3_EIE) == (USART_CR3_EIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART CTS Interrupt is enabled or disabled.
  * @rmtoll
  *  CR3          CTSIE         LL_USART_IsEnabledIT_CTS
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_HWFLOW_INSTANCE(p_usart) can be used to check whether or not
  *         Hardware Flow control feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledIT_CTS(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR3, USART_CR3_CTSIE) == (USART_CR3_CTSIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the USART Wake Up from Stop Mode Interrupt is enabled or disabled.
  * @rmtoll
  *  CR3          WUFIE         LL_USART_IsEnabledIT_WKUP
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_WAKEUP_FROMSTOP_INSTANCE(p_usart) can be used to check whether or not
  *         Wake-up from Stop mode feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledIT_WKUP(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR3, USART_CR3_WUFIE) == (USART_CR3_WUFIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if USART TX FIFO Threshold Interrupt is enabled or disabled.
  * @rmtoll
  *  CR3          TXFTIE        LL_USART_IsEnabledIT_TXFT
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledIT_TXFT(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR3, USART_CR3_TXFTIE) == (USART_CR3_TXFTIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the Smartcard Transmission Complete Before Guard Time Interrupt is enabled or disabled.
  * @rmtoll
  *  CR3          TCBGTIE       LL_USART_IsEnabledIT_TCBGT
  * @param  p_usart USART Instance
  * @note   Macro IS_SMARTCARD_INSTANCE(p_usart) can be used to check whether or not
  *         Smartcard feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledIT_TCBGT(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR3, USART_CR3_TCBGTIE) == (USART_CR3_TCBGTIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if USART RX FIFO Threshold Interrupt is enabled or disabled.
  * @rmtoll
  *  CR3          RXFTIE        LL_USART_IsEnabledIT_RXFT
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledIT_RXFT(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR3, USART_CR3_RXFTIE) == (USART_CR3_RXFTIE)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup USART_LL_EF_DMA_Management DMA_Management
  * @{
  */

/**
  * @brief  Enable DMA Mode for reception.
  * @rmtoll
  *  CR3          DMAR          LL_USART_EnableDMAReq_RX
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_EnableDMAReq_RX(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR3, USART_CR3_DMAR);
}

/**
  * @brief  Disable DMA Mode for reception.
  * @rmtoll
  *  CR3          DMAR          LL_USART_DisableDMAReq_RX
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_DisableDMAReq_RX(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR3, USART_CR3_DMAR);
}

/**
  * @brief  Check if DMA Mode is enabled for reception.
  * @rmtoll
  *  CR3          DMAR          LL_USART_IsEnabledDMAReq_RX
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledDMAReq_RX(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR3, USART_CR3_DMAR) == (USART_CR3_DMAR)) ? 1UL : 0UL);
}

/**
  * @brief  Enable DMA Mode for transmission.
  * @rmtoll
  *  CR3          DMAT          LL_USART_EnableDMAReq_TX
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_EnableDMAReq_TX(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_SET_BIT_32(p_usart->CR3, USART_CR3_DMAT);
}

/**
  * @brief  Disable DMA Mode for transmission.
  * @rmtoll
  *  CR3          DMAT          LL_USART_DisableDMAReq_TX
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_DisableDMAReq_TX(USART_TypeDef *p_usart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_usart->CR3, USART_CR3_DMAT);
}

/**
  * @brief  Check if DMA Mode is enabled for transmission.
  * @rmtoll
  *  CR3          DMAT          LL_USART_IsEnabledDMAReq_TX
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledDMAReq_TX(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR3, USART_CR3_DMAT) == (USART_CR3_DMAT)) ? 1UL : 0UL);
}

/**
  * @brief  Enable DMA Disabling on Reception Error.
  * @rmtoll
  *  CR3          DDRE          LL_USART_EnableDMADeactOnRxErr
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_EnableDMADeactOnRxErr(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->CR3, USART_CR3_DDRE);
}

/**
  * @brief  Disable DMA Disabling on Reception Error.
  * @rmtoll
  *  CR3          DDRE          LL_USART_DisableDMADeactOnRxErr
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_DisableDMADeactOnRxErr(USART_TypeDef *p_usart)
{
  STM32_CLEAR_BIT(p_usart->CR3, USART_CR3_DDRE);
}

/**
  * @brief  Indicate if DMA Disabling on Reception Error is disabled.
  * @rmtoll
  *  CR3          DDRE          LL_USART_IsEnabledDMADeactOnRxErr
  * @param  p_usart USART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_USART_IsEnabledDMADeactOnRxErr(const USART_TypeDef *p_usart)
{
  return ((STM32_READ_BIT(p_usart->CR3, USART_CR3_DDRE) == (USART_CR3_DDRE)) ? 1UL : 0UL);
}

/**
  * @brief  Get the data register address used for DMA transfer.
  * @rmtoll
  *  RDR          RDR           LL_USART_DMA_GetRegAddr \n
  *  TDR          TDR           LL_USART_DMA_GetRegAddr
  * @param  p_usart USART Instance
  * @param  direction This parameter can be one of the following values:
  *         @arg @ref LL_USART_DMA_REG_DATA_TRANSMIT
  *         @arg @ref LL_USART_DMA_REG_DATA_RECEIVE
  * @retval Address of data register
  */
__STATIC_INLINE uint32_t LL_USART_DMA_GetRegAddr(const USART_TypeDef *p_usart, uint32_t direction)
{
  uint32_t data_reg_addr;

  if (direction == LL_USART_DMA_REG_DATA_TRANSMIT)
  {
    /* return address of TDR register */
    data_reg_addr = (uint32_t) &(p_usart->TDR);
  }
  else
  {
    /* return address of RDR register */
    data_reg_addr = (uint32_t) &(p_usart->RDR);
  }

  return data_reg_addr;
}

/**
  * @}
  */

/** @defgroup USART_LL_EF_Data_Management Data_Management
  * @{
  */

/**
  * @brief  Read Receiver Data register (Receive Data value, 8 bits).
  * @rmtoll
  *  RDR          RDR           LL_USART_ReceiveData8
  * @param  p_usart USART Instance
  * @retval Value between Min_Data=0x00 and Max_Data=0xFF
  */
__STATIC_INLINE uint8_t LL_USART_ReceiveData8(const USART_TypeDef *p_usart)
{
  return (uint8_t)(STM32_READ_BIT(p_usart->RDR, USART_RDR_RDR) & 0xFFU);
}

/**
  * @brief  Read Receiver Data register (Receive Data value, 9 bits).
  * @rmtoll
  *  RDR          RDR           LL_USART_ReceiveData9
  * @param  p_usart USART Instance
  * @retval Value between Min_Data=0x00 and Max_Data=0x1FF
  */
__STATIC_INLINE uint16_t LL_USART_ReceiveData9(const USART_TypeDef *p_usart)
{
  return (uint16_t)(STM32_READ_BIT(p_usart->RDR, USART_RDR_RDR));
}

/**
  * @brief  Write in Transmitter Data Register (Transmit Data value, 8 bits).
  * @rmtoll
  *  TDR          TDR           LL_USART_TransmitData8
  * @param  p_usart USART Instance
  * @param  Value between Min_Data=0x00 and Max_Data=0xFF
  */
__STATIC_INLINE void LL_USART_TransmitData8(USART_TypeDef *p_usart, uint8_t Value)
{
  p_usart->TDR = Value;
}

/**
  * @brief  Write in Transmitter Data Register (Transmit Data value, 9 bits).
  * @rmtoll
  *  TDR          TDR           LL_USART_TransmitData9
  * @param  p_usart USART Instance
  * @param  Value between Min_Data=0x00 and Max_Data=0x1FF
  */
__STATIC_INLINE void LL_USART_TransmitData9(USART_TypeDef *p_usart, uint16_t Value)
{
  p_usart->TDR = (uint16_t)(Value & 0x1FFUL);
}

/**
  * @}
  */

/** @defgroup USART_LL_EF_Execution Execution
  * @{
  */

