MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_usart.h
/**
  * @brief  Set a Request.
  * @rmtoll
  *  RQR          SBKRQ         LL_USART_SetRequest \n
  *  RQR          MMRQ          LL_USART_SetRequest \n
  *  RQR          RXFRQ         LL_USART_SetRequest \n
  *  RQR          TXFRQ         LL_USART_SetRequest \n
  *  RQR          ABRRQ         LL_USART_SetRequest
  * @param  p_usart USART Instance
  * @param  request Request to set
  *         @arg @ref LL_USART_REQUEST_SEND_BREAK
  *         @arg @ref LL_USART_REQUEST_MUTE_MODE
  *         @arg @ref LL_USART_REQUEST_RX_DATA_FLUSH
  *         @arg @ref LL_USART_REQUEST_TX_DATA_FLUSH
  *         @arg @ref LL_USART_REQUEST_AUTO_BAUD_RATE
  */
__STATIC_INLINE void LL_USART_SetRequest(USART_TypeDef *p_usart, uint32_t request)
{
  STM32_SET_BIT(p_usart->RQR, (uint16_t)request);
}

/**
  * @brief  Request an Automatic Baud Rate measurement on next received data frame.
  * @rmtoll
  *  RQR          ABRRQ         LL_USART_RequestAutoBaudRate
  * @param  p_usart USART Instance
  * @note   Macro IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(p_usart) can be used to check whether or not
  *         Auto Baud Rate detection feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_RequestAutoBaudRate(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->RQR, (uint16_t)USART_RQR_ABRRQ);
}

/**
  * @brief  Request Break sending.
  * @rmtoll
  *  RQR          SBKRQ         LL_USART_RequestBreakSending
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_RequestBreakSending(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->RQR, (uint16_t)USART_RQR_SBKRQ);
}

/**
  * @brief  Put USART in mute mode and set the RWU flag.
  * @rmtoll
  *  RQR          MMRQ          LL_USART_RequestEnterMuteMode
  * @param  p_usart USART Instance
  */
__STATIC_INLINE void LL_USART_RequestEnterMuteMode(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->RQR, (uint16_t)USART_RQR_MMRQ);
}

/**
  * @brief  Request a Receive Data and FIFO flush.
  * @rmtoll
  *  RQR          RXFRQ         LL_USART_RequestRxDataFlush
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  * @note   Allows to discard the received data without reading them, and avoid an overrun
  *         condition.
  */
__STATIC_INLINE void LL_USART_RequestRxDataFlush(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->RQR, (uint16_t)USART_RQR_RXFRQ);
}

/**
  * @brief  Request a Transmit data and FIFO flush.
  * @rmtoll
  *  RQR          TXFRQ         LL_USART_RequestTxDataFlush
  * @param  p_usart USART Instance
  * @note   Macro IS_UART_FIFO_INSTANCE(p_usart) can be used to check whether or not
  *         FIFO mode feature is supported by the p_usart instance.
  */
__STATIC_INLINE void LL_USART_RequestTxDataFlush(USART_TypeDef *p_usart)
{
  STM32_SET_BIT(p_usart->RQR, (uint16_t)USART_RQR_TXFRQ);
}

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

#endif /* USART1 || USART2 || USART3 || UART4 || UART5 || USART6 || UART7 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5XX_LL_USART_H */

